[{
  "_id": {
    "$oid": "649d8da410170921a743bf10"
  },
  "index": "SD_resume_5.pdf",
  "category": "software developer",
  "text": "rsum david baumgold david baumgold fullstack web developer open source contributor technical trainer public speaker located amsterdam web email  mastodon mastodonsocialsingingwolfboy skills languages python typescript graphql sql postgresql mysql regex frameworks django flask sqlalchemy react redux bootstrap svelte tools git mypy sphinx babel webpack http apis devops aws docker actions homebrew ssh nginx linux server administration testing tdd pytest mock jest open source communication communitybuilding outreach advocacy experience sta python developer ribbon home since march 2021 python django react graphql focused identifying paying technical debt across codebase working several team across company planned implemented adoption chakra ui component library across frontend codebase increasing development speed visual consistency executed multiple important upgrade across backend improve reliability avoid dependency unsupported open source project  senior python developer nylas june 2018 march 2021 python flask tech lead small development team focused improving calendarbased feature shipped product generated million dollar arr lead several largescale technical migration including switching python 2 python 3 switching selfhosted jenkins ci installation cloudhosted actions senior frontend developer impraise sep 2017 may 2018 react graphql ruby rails lead small team develop dynamic reactbased frontend impraise web application assisted migrating legacy restbased backend one based graphql consultant serendipity consulting jan 2016 sep 2017 worked freelance consultant helping company develop robust maintainable website using python javascript clients included nylas helped update modernize python sdk nylas revamping test suite adding python 3 support classforward helped build djangobased website working small team also provided mentorship guidance junior developer helped establish best practice high quality development mits oce digital learning assisted micromasters project using django drf django rest framework react es6 ecmascript 6 webpack zeolearn taught class zeolearns client topic including django git edx took unmaintained python project edx depended upgraded modern reliable documented software engineer developer advocate edx may 2013 jan 2016 open source pythondjango web application backbonejs frontend lead development major component application well spearheading major codecleanup refactoring eorts agile scrumbased workflow organized assisted open source community eorts use software organized major software release advocated documentation feature specific community use spoke open edx conference helped organize open edx conference software engineer cloudlock sep 2011 apr 2013 python web application running google app engine assisted major architectural restructuring work app engines eventuallyconsistent datastore increased developer productivity communication education tooling automated testing software engineer tripadvisor aug 2010 aug 2011 php web application dynamic javascript frontend integrated java codebase worked fullstack developer small agile team fixing bug adding feature many dierent level codebase junior systems administrator guru computer science department brandeis university dec 2007 may 2010 worked small team manage maintain upgrade network 100 mac linux computer provided routine support assistance university student professor education masters degree computer science brandeis university spring 2010 summer 2010 bachelors degree computer science brandeis university fall 2006 fall 2009 bachelors degree psychology brandeis university fall 2006 fall 2009",
  "parsed_resume": {
    "name": "David Baumgold",
    "email": "david@davidbaumgold.com",
    "mobile_number": null,
    "skills": [
      "Administration",
      "Sqlalchemy",
      "Email",
      "Mypy",
      "Mock",
      "Pytest",
      "Nylas",
      "Sql",
      "Java",
      "Agile",
      "Ruby",
      "Postgresql",
      "Linux",
      "Aws",
      "Open source",
      "Outreach",
      "Flask",
      "Docker",
      "Sphinx",
      "Scrum",
      "Communication",
      "Consulting",
      "Psychology",
      "Apis",
      "Github",
      "Rest",
      "Babel",
      "Visual",
      "Mysql",
      "Technical",
      "Installation",
      "Cloud",
      "Python",
      "Ui",
      "Php",
      "Documentation",
      "Django",
      "Javascript",
      "Testing",
      "Website"
    ],
    "college_name": null,
    "degree": [
      "Bachelors degree in Computer Science",
      "Masters degree in Computer Science",
      "Bachelors degree in Psychology"
    ],
    "designation": [
      "Software Engineer at TripAdvisor"
    ],
    "experience": [
      "Sta! Python Developer at Ribbon Home",
      "since March 2021",
      "Python, Django, React, GraphQL. Focused on identifying and paying down technical",
      "debt across the codebase, working with several teams across the company. Planned",
      "and implemented the adoption of the Chakra UI component library across the",
      "frontend codebase, increasing development speed and visual consistency. Executed",
      "multiple important upgrades across the backend to improve reliability and avoid",
      "dependencies on unsupported open source projects.",
      "Senior Python Developer at Nylas",
      "June 2018 to March 2021",
      "Python, Flask. Tech lead for a small development team focused on improving",
      "calendar-based features. Shipped products that generated millions of dollars in ARR.",
      "Lead several large-scale technical migrations, including switching from Python 2 to",
      "Python 3 and switching from a self-hosted Jenkins CI installation to cloud-hosted",
      "GitHub Actions.",
      "Senior Front-end Developer at Impraise",
      "Sep 2017 to May 2018",
      "React, GraphQL, Ruby on Rails. Lead a small team to develop a dynamic React-based",
      "front-end for the Impraise web application. Assisted in migrating from a legacy",
      "REST-based backend to one based on GraphQL.",
      "Consultant at Serendipity Consulting",
      "Jan 2016 to Sep 2017",
      "Worked as a freelance consultant, helping companies develop robust and",
      "maintainable websites using Python and JavaScript. Clients included:",
      "Nylas: I helped update and modernize the Python SDK for Nylas, revamping the",
      "test suite and adding Python 3 support.",
      "ClassForward: I helped build out their Django-based website, working on a",
      "small team. I also provided mentorship and guidance for their junior developers,",
      "and helped establish best practices for high quality development.",
      "MIT's O!ce of Digital Learning: I assisted with their Micromasters project,",
      "using Django, DRF (Django Rest Framework), React, ES6 (ECMAScript 6), and",
      "Webpack.",
      "Zeolearn: I taught classes to Zeolearn's clients, with topics including Django",
      "and Git/GitHub.",
      "edX: I took over an unmaintained Python project that edX depended on, and",
      "upgraded it to be more modern, reliable, and documented.",
      "Software Engineer, Developer Advocate at edX",
      "May 2013 to Jan 2016",
      "Open source Python/Django web application with Backbone.js frontend. Lead",
      "development of major components of the application, as well as spearheading major",
      "code-cleanup and refactoring e!orts in an agile, Scrum-based workﬂow.",
      "Organized and assisted the open source community in their e!orts to use the",
      "software; organized major software releases, advocated for documentation and",
      "features speciﬁc to the community’s use. Spoke about Open edX at conferences, and",
      "helped organize the Open edX Conference.",
      "Software Engineer at CloudLock",
      "Sep 2011 to Apr 2013",
      "Python web application running on Google App Engine. Assisted with a major",
      "architectural restructuring to work with App Engine’s eventually-consistent datastore.",
      "Increased developer productivity through communication, education, tooling, and",
      "automated testing.",
      "Software Engineer at TripAdvisor",
      "Aug 2010 to Aug 2011",
      "PHP web application with a dynamic Javascript front-end, integrated into a Java",
      "codebase. Worked as a full-stack developer in a small, agile team, ﬁxing bugs and",
      "adding features in many di!erent levels of the codebase.",
      "Junior Systems Administrator (Guru) at Computer Science Department, Brandeis",
      "University",
      "Dec 2007 to May 2010",
      "Worked in a small team to manage, maintain, and upgrade a network of over 100 Mac",
      "and Linux computers. Provided routine support and assistance to university students",
      "and professors."
    ],
    "company_names": null,
    "no_of_pages": 3,
    "total_experience": 12.75
  }
},
{
  "_id": {
    "$oid": "649d8da610170921a743bf11"
  },
  "index": "SD_resume_8.pdf",
  "category": "software developer",
  "text": "rakesh neela resume r k e h n e e l h sanfancisco ca 94066 5103099296  rakeshneela b l e e v e l p e r qu l f c n pr f l e performancefocused highly analytical professional equipped handson experience within field computer science encompassing software engineering well mobile web desktop application development support business development initiative additional qualification include 7 year software experience evaluation design development testing maintenance production support using sdlc process agile methodology 5 year experience building ios mobile application using objectivec swift cocoa touch frameworks experience working lead software engineer senior mobile ios developer successful involved built numerous project aspect inception production phase experience building shipping consumerfacing enterprise native ios application experience working retail health bluetooth technology based industry equipped handson experience database programming various programming language effective establishing relationship worked collaboratively graphic design lead uiux team project manager client effectively develop application ar e f ex p e r e ios mobile application development mathematical models objectoriented technology algorithm implementation web programming blockchain programming database design development te c h n c l c u e n programming languages swift objective c c c java python matlab mobile development swift23x4x5 swift ui objectivec xcode8910 rxswift android sdk phone gap frontend html 5 css 3 javascript jquery ruby rails bootstrap php database backend oracle sqlite mysql parse firebase aws tools server git svn bitbucket source tree jenkins apache postman appium mamp pro wordpress ios design patterns mvc singleton notification blocks delegation facade observables mvvm extensions js visualization libraries heat map high charts d3js amcharts raphael highcharts maps threejs awejs arjs ios frameworks ui kit views auto layouts arkit cloud kit gcd concurrency operations time profiler map kit speech av foundation device util core data core location core graphics social xc test ui performance test printer alamo fire networking encode decode user defaults sdwebimage quartzcore crashalytics logger new relic scanner core bluetoothble core graphics appkit core motion localization location attribute services keychain encryption ipa package archiver gradle pod component builder camera peripheral integration pr f e n l ex p e r e n c e gap inc san francisco ca sr ios mobile developer employer ca one tech cloud inc mar 2019 till date involved building store mobile application gap brand includes gap athleta banana republic old navy others worked store inventory management teams identified business requirement architected building instock back house mobile store applications project management done jira includes userstories bug took care pull request worked workflow issue inaccordance new story bug reported business requirement use source tree git source code management configure jenkins pipeline deploy application update timely manner worked building deploying application gap inc app store airwatch used ios swift knowledge building mobile store application used swift objective c building exclusive gap framework pod creation ios mobile application worked ios feature includes core data reachability scanner printer ui component creation url session worked extensively swift 4x swift 5 objectivec core data cocoa touch frameworks mvc model writing unit test ui test performance test fixing app crash bug priority basis following gap mobile app standard review managing app certification develop worked rest cloud services framework business logic layer simplify complexity application environment swift 425 objectivec xcode mac os x shell script c coredata unity dbeaver mysql jira postman javascript hive git source tree swift lint jenkins invision new relic printer scanner camera peripheral integrations walmart bentonville ar sr ios mobile developer employer cognizant bentonville ar sep 2017 feb 2019 involved building global walmart store mobile application worked implementing automation retail core technology project worked various category specialist manager includes fashion electronics home baby others worked extensively swift 4x swift 5 objectivec core data cocoa touch frameworks mvc model project management jira assigned userstoriesbugs developer took care pull request coordinated offshore onsite developer manage work assignment worked various technology database update includes swift objectivec oracle db java jira atom postman apache solr apache product information management pim used source tree application source code management worked closely grocery catalog siti dataops team build ecommerce mobile application worked augment reality application core team member building app architecture worked extensively vuforia ar kit 2 cocoa touch frameworks environment swift 403x objectivec xcode 9x10x ios 10x arkit coredata unity awejs arjs threejs vuforia shell script jira atom postman nodejs javascript hive rest web services framework spark kafka xml xsd maven javaj2ee mysql cassandra crashalaytics infinite key holland mi usa software engineer may 2017 aug 2017 made use phone key technology product home appliance replacing key fob work station system maintained proactive participation agile scrum meeting ensure efficiency product detail proactively performed microlocating algorithm simulation os x linux environment held responsibility development ruby javascript run embedded environment built tool configuration os x linux system beta testing application via test flight designed developed mobile application using swift profound knowledge ios application framework development using objectivec swift cocoa touch framework experience working geo fence ibeacons region monitoring indoor navigation blue tooth technology contributed creation ios mobile application iot phone swift objectivec aws jenkins distributed application test flight apple app store distributed enterprise app densco used jenkins achieve integration continuous deployment used agile tool like jira bug reporting regression testing user acceptance testing uat production build test cycle delivering effective product used source tree application source code management proficiency memory management manual reference counting mrc automatic reference counting arc used grand central dispatch gcd nsoperation queue implemented complex multithreaded feature application nsjsonserialization retrieve data server using restful web service wrote unit test xctests created bot automatically identify defect code performance regression environment swift 3x objectivec xcode c ruby javascript mac os x linux cocoa touch frameworks ble iot sensors xc tests geo fence ibeacons region monitoring indoor navigation blue tooth technology jenkins xc tests gcd nsoperation queue mrc arc uat grand valley state university grand rapids mi usa software engineer assistant jan 2016 apr 2017 app links developed ios mobile application upward bound staff conceptualization implementation worked closely staff member performed requirement analysis developed conceptual design prototype implemented system new code coordinated worked different application team various level endtoend integration project developed universal mobile application ipad iphone created implemented ios mobile application using swift 3x objectivec xcode 9 mac os c firebase javascript bootstrap aws worked objectivec cocoa touch framework coredata uikit coretext coregraphics nsurlconnection message ui framework function implementation demonstrated keen understanding app store guideline published app app store developed critical tool project like customized navigation bar page control scroll view prefetched data different view smooth screen transition streamlined several core level feature like calendar event contact invite event schedule tracking attendance reporting system used bitbucket source code management revision control system worked uikit framework development maintenance integrated reminder create new qr code take time record event either hourly daily weekly environment swift 3x objectivec xcode 9 ios 8 sdk mac os c firebase bootstrap ruby json cocoa touch framework agile development ruby javascript restful api bootstrap coredata uikit coretext coregraphics nsurlconnection message ui framework navigation bar page controller scroll view bitbucket retisense bengaluru india lead software engineer sep 2014 nov 2015 app links drove key effort toward product development conceptualization deployment worked team four develop publish mobile application app store managed product development execution including stridalyzer iotbased application fitness tracker bluetooth low energy blebased product earned promotion lead software engineer excellent performance professionalism initiated ios mobile application runner swift objectivec xcode ios 8 sdk mac os json cocoa touch framework agile development parse trained delivering high quality restful apis nosql database like parse amazon aws developed ios app backend improving performance reducing resource consumption facilitated evaluation biomechanical mathematical model fitness tracker expertly handled agile project conducting meeting ensure efficiency product attained knowledge iot sensor established communication sensor mobile application used bitbucket source code management revision control system developed ios app cocoapods ruby javascript created responsive web portal generate dynamic web report runner javascript bootstrap spearheaded integration thirdparty application programming interface apis framework library environment swift 3x objectivec xcode 89 ios 8 sdk mac os json cocoa touch framework agile development parse amazon aws iot sensors ruby javascript restful api bootstrap ui kit ble heatmaps map kit bitbucket skyfi labs bengaluru ka india engineer aug 2012 sept 2014 worked developing inhouse ios mobile application tracking project kickoff meeting project update incident reporting using objectivec presided workshop various staff create awareness trained student professional various mobile technology ios unity android led setup launching javabased centralized database system scratch end trained employee use said application kresit iit bombay mumbai mh india research intern jan 2011 dec 2011 assumed responsibility integration legacy inductive logic programming ilp system single umbrella architecture collaborated different researcher programmer student obtain keen understanding requirement build product scratch executed development ilp tool c java along integrated system linux earned research fellowship involved development tool iit bombay ed u c n n cr e e n l master science computer information science grand valley state university grand rapids michigan bachelor technology computer science engineering jawaharlal nehru technological university hyderabad india iphone programmer certification using objectivec keshav memorial institute technology hyderabad india ios development creative entrepreneurs using swift objectivec online courseera certified web designer mecha hawks company odisha india b l e pr j e c attendance tracker ios app closely monitor course student attendance following feature app integration scheme integrated social network scheme notification scheme third party cocoa pod ns core data application scaled smart entry system using face detection augment reality experience building ecommerce mobile application based augument reality experience application based ar kit 20 unity awejs arjs threejs vuforia swift 42 tambola game ios mobile game support multiuser sqllite database mychapterapp social friendshipmaking mobile app software used swift aws xcode objectivec mac os x chinese zodiac center development mobile application chinese people basic information user hisher interest software used windows sdk c h e pr j e c application infrastructure support trio upward bound program application created support upward bound staff member application reduces manual effort needed take attendance manage information providing mobile application also help staff member generate automated report count meal served used swift objectivec aws firebase javascript bootstrap technology provisioning quality service qos multimedia traffic cellular networks proposed appropriate call admission control system bandwidth request model quality service allocation model consideration realtime traffic application group three cellular network bandwidth modeling multimedia traffic cellular network elseivers journal simulation modeling practice theory characteristic function variablebitrate multimedia qos springers advances intelligent systems computing integration weka backgroundexamplestheory bet provision umbrella architecture various ilp system produce theory consistent background knowledge example aw r n h n r best department project gvsu innovation showcase 1st prize technical quiz competition 1st prize best alarm watch design 2nd prize jigyasa technical paper presentation",
  "parsed_resume": {
    "name": "STATE UNIVERSITY",
    "email": "rakeshneela@outlook.com",
    "mobile_number": "510.309.9296",
    "skills": [
      "Updates",
      "Oracle",
      "Ios",
      "Api",
      "Windows",
      "Research",
      "Github",
      "Inventory",
      "Architecture",
      "Jira",
      "Engineering",
      "Reports",
      "Android",
      "Product development",
      "Fitness",
      "Iphone",
      "Schedules",
      "Os",
      "Sql",
      "Ruby",
      "Networking",
      "Electronics",
      "Json",
      "R",
      "C++",
      "Computer science",
      "Database",
      "Mobile",
      "Python",
      "Ux",
      "C",
      "Css",
      "Wordpress",
      "Js",
      "Testing",
      "Presentation",
      "System",
      "Nosql",
      "Java",
      "Analytical",
      "Aws",
      "Linux",
      "Xml",
      "Writing",
      "Reporting",
      "Requests",
      "Automation",
      "Analysis",
      "Programming",
      "Mysql",
      "Cloud",
      "Php",
      "Objective-c",
      "Hive",
      "Html",
      "Workflow",
      "Agile",
      "Health",
      "Sdlc",
      "Swift",
      "P",
      "Scrum",
      "Communication",
      "Apis",
      "Certification",
      "Rest",
      "Shell",
      "Operations",
      "Software engineering",
      "Technical",
      "Process",
      "Ui",
      "Matlab",
      "Design",
      "Retail",
      "Javascript",
      "Modeling",
      "Spark"
    ],
    "college_name": null,
    "degree": [
      "Master of Science in Computer Information Science",
      "Bachelor of Technology in Computer Science Engineering"
    ],
    "designation": [
      "Software Engineer Assistant",
      "Lead Software Engineer"
    ],
    "experience": [
      "§  Contributed to the creation of iOS mobile application in IoT and phone through Swift, Objective-C, AWS and Jenkins",
      "§  Distributed application through test flight and Apple App store, distributed enterprise app through Densco",
      "§  Used Jenkins to achieve Integration and Continuous deployment",
      "§  Used Agile tools like JIRA for Bug Reporting, Regression Testing, User Acceptance testing (UAT) and production builds",
      "test cycle for delivering effective product",
      "§  Used Source Tree Application (GitHub) for source code management",
      "§  Proficiency with memory management: Manual Reference Counting (MRC) and Automatic Reference Counting (ARC)",
      "§  Used Grand Central Dispatch (GCD), NSOperation queues for implemented complex multi-threaded features on the",
      "application and NSJSONSerialization to retrieve data from server using RESTful web services.",
      "§  Wrote unit tests (XCTests) and created bots to automatically identify defects in code and performance regressions.",
      "Environment: Swift 3.x, Objective-C, X-Code, C, Ruby, JavaScript, Mac OS X, Linux, Cocoa Touch Frameworks, BLE, IOT,",
      "Sensors, XC Tests, Geo fences, iBeacons, Region monitoring, Indoor navigation, Blue tooth technology, Jenkins, XC Tests,",
      "GCD, NSOperation Queue, MRC, ARC, UAT",
      "GRAND VALLEY STATE UNIVERSITY, GRAND RAPIDS, MI, USA",
      "Software Engineer Assistant",
      "App Links:",
      "https://itunes.apple.com/ph/app/summer-ub/id1208559481?mt=8",
      "https://itunes.apple.com/us/app/gvsu-laker-mobile/id357181244?mt=8",
      "§  Developed iOS mobile application for Upward Bound Staff from conceptualization to implementation",
      "§  Worked closely with staff members and performed requirement analysis",
      "§  Developed conceptual designs to prototypes and implemented systems into new code"
    ],
    "company_names": [
      "SKYFI LABS"
    ],
    "no_of_pages": 4,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8da810170921a743bf12"
  },
  "index": "SD_resume_2.pdf",
  "category": "software developer",
  "text": "cobaohieuresume co bao hieu hochiminh city vn cobaohieu comincobaohieu work experience bosch global software technologies company limited hochiminh city vn software engineer dec 2021 present scanning source code internal customer analyzing marking component library ensure open source software created modified internal tool support work participated airelated competition well hackathon car innovation software engineer intern sep 2021 dec 2021 involved newcomer training course dek technologies vietnam hochiminh city vn software engineer may 2020 may 2021 handled unittest characteristic test robustness test case ttcn3 based tcpsctpudp ip voice lte volte erlang gerrits site via git command customized linux operating system openstack virtualization kvm vmware monitored jenkin site worked agile scrum military insurance corporation cantho city vn insurance salesman aug 2017 dec 2020 sought advised sold motorcycle insurance customer understood needed mobifone service company region 9 cantho city vn support staff apr 2017 feb 2020 sketched expense plan business strategy dealt customer mobile data usage reported summary revenue result previous day quarter year via microsoft office designed content implemented digital marketing strategy social network facebook zalo google youtube website ecommerce network carried traditional marketing event delta mekong received feedback envi technology llc cantho city vn helpdesk may 2016 aug 2016 initiated maintained established hardware software computer printer fpt  cantho city vn technical staff nov 2015 mar 2016 swapped deployed coppertofiber outside inside customer home installed service wifi equipment provided fpt  education tho university july 2022 ms computer science gpa 304 tho university aug 2018 bs information technology gpa 294 tho vocational college sep 2015 computer network management gpa 9010 skills interests languages python erlang html css php sql c c c java least proficient interests reading cooking writing traveling researching learning language volunteering mediation mailtocobaohieu",
  "parsed_resume": {
    "name": "Bao Hieu",
    "email": "cobaohieu@gmail.com",
    "mobile_number": null,
    "skills": [
      "System",
      "Java",
      "Microsoft office",
      "Sql",
      "Agile",
      "Linux",
      "Writing",
      "Vmware",
      "Marketing",
      "Scrum",
      "C++",
      "Internal customers",
      "Ai",
      "Openstack",
      "Facebook",
      "Wifi",
      "Content",
      "Technical",
      "Mobile",
      "Python",
      "Researching",
      "Php",
      "Training",
      "C",
      "Css",
      "Html",
      "Telecom",
      "Hardware",
      "Unittest"
    ],
    "college_name": null,
    "degree": [
      "M.S. Computer Science",
      "B.S. Information Technology"
    ],
    "designation": [
      "Software Engineer",
      "Software Engineer Intern",
      "Technical Staff"
    ],
    "experience": [
      "Bosch Global Software Technologies Company Limited",
      "Software Engineer",
      "HoChiMinh City, VN",
      "Dec 2021 – Present",
      "• Scanning source code from internal customers, analyzing and marking it into components or libraries to",
      "ensure it is Open Source Software",
      "• Created and modified some internal tool support the work",
      "• Participated in some AI-related competitions, as well as Hackathon and Car Innovation",
      "Software Engineer Intern",
      "• Involved in some newcomer training courses",
      "DEK Technologies Vietnam",
      "Software Engineer",
      "Sep 2021 – Dec 2021",
      "HoChiMinh City, VN",
      "May 2020 – May 2021",
      "• Handled Unittest, Characteristic test, and Robustness test cases on TTCN3 based on TCP/SCTP/UDP of IP,",
      "Voice over LTE (VoLTE) through Erlang on Gerrit’s site via Git command",
      "• Customized Linux operating system with OpenStack, Virtualization (KVM, VMware) and monitored it on the",
      "Jenkin site. Worked with Agile Scrum",
      "Military Insurance Corporation",
      "Insurance Salesman",
      "CanTho City, VN",
      "Aug 2017 – Dec 2020",
      "• Sought, advised and sold motorcycle insurance to customers who understood and needed it",
      "MobiFone Service Company Region 9",
      "Support Staff",
      "CanTho City, VN",
      "Apr 2017 – Feb 2020",
      "• Sketched out expense plans and business strategies, and dealt with customer mobile data usage. Reported"
    ],
    "company_names": [
      "HoChiMinh City"
    ],
    "no_of_pages": 1,
    "total_experience": 8.92
  }
},
{
  "_id": {
    "$oid": "649d8da910170921a743bf13"
  },
  "index": "SD_resume_6.pdf",
  "category": "software developer",
  "text": "andrew dillon resume andrew dillon 402 6317966 andrewdillonj   cominandrewjdillon im passionate software engineer open source maintainer writer leader enjoy solving hard problem building high quality product people love use im cheerful team player strive bring best others skills leadership teamwork writing communication teaching agile mentoring learning listening technologies react react native nodejs spring boot typescript javascript java kotlin go python jupyter docker aws kubernetes openshift sql education university missouri saint louis st louis mo 2016 2020 master computer science personal projects pdflib widely used library manipulating pdf document javascript environment 2500 star 100000 weekly npm downloads jsv9000app interactive web app visualizes explains javascripts event loop used instructor coding school help developer learn async javascript work chip cli tool speed development simplifying management microservices infrastructure local environment actively used multiple team unigroup work experience unigroup st louis senior software engineer november 2019 present tech lead full stack software engineer using primarily react spring boot postgresql agile environment led team developed new billing system van line lead updated distribution algorithm assigning lead agent increasing business 500 agent network adding 3000000 company revenue led development team creating system automate streamline scheduling event customer connecting agent calendar thereby reducing wait time 2 day 12 hour 100000 customer annually leading increased revenue designed built system network agent configure geographic service area subsystem lead distribution improved cx thousand customer eliminated 2000000 annual expense increasing efficiency effectiveness transportation network formed led crossteam group frontend engineer ui designer built library reusable react component improved stability application increased velocity 70 development team reducing waste allowing code reuse unigroup st louis software engineer march 2018 november 2019 full stack software engineer using primarily react react native spring boot rabbitmq postgresql agile environment designed built web app backend system pilot new customer experience pricing model completed project mere 8 week several feature pilot program made permanent increased customer conversion rate translating 500000 additional revenue designed built ios android mobile app backend system improved speed efficiency 1000 packer allowed perform electronic inventory lowconnectivity area freeing 750000 previously spent errorprone 3rd party app independently developed system produce business metric statistic electronic inventory app gave team vital information apps effectiveness problem area allowing u proactively identify address production issue maryville technologies st louis software engineering intern december 2016 march 2018 full stack software engineer using primarily react native spring boot golang postgresql agile environment designed built ios android mobile app backend system allow 2500 van operator track service load even lowconnectivity area forming key piece infrastructure 100000000 business",
  "parsed_resume": {
    "name": "cid:57)ORK E(cid:58)PER(cid:882)ENCE",
    "email": "a(cid:80)(cid:70)(cid:84)(cid:71)(cid:89).(cid:70)(cid:75)(cid:78)(cid:78)(cid:81)(cid:80).(cid:76)@(cid:73)(cid:79)a(cid:75)(cid:78).(cid:69)(cid:81)(cid:79)",
    "mobile_number": "631-7966",
    "skills": [
      "Java",
      "Sql",
      "Agile",
      "Ios",
      "Postgresql",
      "Aws",
      "Expenses",
      "Teaching",
      "Writing",
      "Docker",
      "Statistics",
      "Transportation",
      "Billing",
      "Communication",
      "Distribution",
      "Github",
      "Metrics",
      "Mobile",
      "Ui",
      "Interactive",
      "Android",
      "Pdf",
      "Conversion",
      "Javascript",
      "Coding",
      "Scheduling"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
      "mere 8 weeks. Several features of this pilot program were made",
      "permanent and increased our customer conversion rate, translating to",
      "over $500,000 of additional revenue.",
      "● Designed and built an iOS & Android mobile app and backend s(cid:92)stems",
      "that improved the speed & efficienc(cid:92) of 1000+ packers and allowed them",
      "to perform electronic inventories in low-connectivit(cid:92) areas, freeing up",
      "$750,000 that was previousl(cid:92) spent on an error-prone 3rd part(cid:92) app.",
      "●",
      "Independentl(cid:92) developed a s(cid:92)stem to produce business metrics and",
      "statistics for our electronic inventor(cid:92) app that gave our team vital",
      "information about our app(cid:182)s effectiveness and problem areas, allowing us",
      "jsv9000.app - Interactive web app",
      "to proactivel(cid:92) identif(cid:92) and address production issues.",
      "that visuali(cid:93)es and explains",
      "JavaScript(cid:182)s Event Loop. Used b(cid:92)",
      "instructors and coding schools to",
      "help developers learn how as(cid:92)nc",
      "JavaScript works.",
      "chip - CLI tool that speeds up",
      "development b(cid:92) simplif(cid:92)ing",
      "management of microservices and",
      "infrastructure in local environments.",
      "Activel(cid:92) used b(cid:92) multiple teams at",
      "UniGroup.",
      "Maryville Technologies, St. Louis (cid:178) S(cid:82)f(cid:87)(cid:90)a(cid:85)e E(cid:81)(cid:74)(cid:76)(cid:81)ee(cid:85)(cid:76)(cid:81)(cid:74) I(cid:81)(cid:87)e(cid:85)(cid:81)",
      "DECEMBER 2016 - MARCH 2018",
      "●",
      "Full stack software engineer using primaril(cid:92) React Native, Spring Boot,",
      "Golang, and PostgreSQL in an agile environment.",
      "● Designed and built an iOS & Android mobile app and backend s(cid:92)stems to",
      "allow 2500+ van operators to track and service loads, even in",
      "low-connectivit(cid:92) areas, forming a ke(cid:92) piece of infrastructure for",
      "$100,000,000+ of business."
    ],
    "company_names": null,
    "no_of_pages": 1,
    "total_experience": 1.25
  }
},
{
  "_id": {
    "$oid": "649d8daa10170921a743bf14"
  },
  "index": "SD_resume_4.pdf",
  "category": "software developer",
  "text": "joel verhagen seattle washington joelverhagen technical skills programming language proficient cnet tsql javascripttypescript html css data technology sql server azure storage azure cosmos db azure data explorer kusto cloud computing azure storage service bus search sql websites functions arm vms work experience principal software engineering manager jun 2021 present microsoft corp nuget visual studio team oversaw daytoday operation nugetorg engineering manager technical lead designed implemented drove adoption nuget package metadata analyzer collaborated partner package repository design begin implementation unified package platform software engineer ii senior software engineer oct 2015 jun 2021 microsoft corp nuget visual studio team drove nugetorg response dependency confusion package management attack optimized validation publishing pipeline nugetorg improving ingestion time 50 designed implemented rearchitectured nugetorg package search using azure search measured success helped design implement package signature validation nugetorg designed repository signing documented nuget http protocol public facing documentation website enabling custom nuget software designed helped implement asynchronous validation package drove nugetorg redesign website fully accessible fresh look implemented net standard framework compatibility nuget client software engineer may 2014 oct 2015 microsoft corp commerce platform maintained improved paginated event store built net sql server implemented generic rest endpoint allows caller efficiently poll resource change implemented notification system built net sql server azure service bus software development engineer intern may aug 2013 microsoft corp commerce platform worked order management system microsofts internal commerce platform applications developer intern jan may 2013 space exploration technologies corp designed developed inbrowser tool edit sensor calibration file flight software c mvc 4 software development engineer test sdet intern mar jun 2012 microsoft corp blend visual studio team wrote debugged automated test case c blend visual studio formerly expression blend development intern spring 2011 fall 2011 seapine software inc worked developing multiplatform bug tracking software c engineering intern summer 2008 summer 2009 sharethis inc designed developed deployed sharethis firefox addon nearly 250000 user education bs computer science sep 2009 may 2014 university cincinnati cincinnati ohio deans list 3850 gpa completed math minor",
  "parsed_resume": {
    "name": "Joel Verhagen",
    "email": "joel.verhagen@gmail.com",
    "mobile_number": null,
    "skills": [
      "System",
      "Sql",
      "Math",
      "Sql server",
      "C++",
      "Publishing",
      "Rest",
      "Operations",
      "Programming",
      "Visual",
      "Technical",
      ".net",
      "Cloud",
      "Engineering",
      "Design",
      "Documentation",
      "C",
      "Css",
      "Javascript",
      "Html",
      "Website"
    ],
    "college_name": null,
    "degree": [
      "B.S. in Computer Science"
    ],
    "designation": [
      "Software Development Engineer",
      "Principal Software Engineering Manager"
    ],
    "experience": [
      "Principal Software Engineering Manager",
      "Microsoft Corp. – NuGet, Visual Studio team",
      "Jun. 2021 – present",
      "•  Oversaw day-to-day operations of nuget.org as the engineering manager and  technical lead",
      "•  Designed, implemented, and drove adoption of a  NuGet package metadata analyzer (github.com/NuGet/Insights)",
      "•  Collaborated with a partner package repository to design and begin implementation of a unified package platform",
      "Software Engineer I, II, Senior Software Engineer",
      "Microsoft Corp. – NuGet, Visual Studio team",
      "Oct. 2015 – Jun. 2021",
      "•  Drove nuget.org response for the “dependency confusion” package management attack",
      "•  Optimized validation and publishing pipelines to  nuget.org, improving ingestion time by ~50%",
      "•  Designed and implemented a re-architectured nuget.org package search using Azure Search , measured success",
      "•  Helped design and implement package signature validation  on nuget.org and designed repository signing",
      "•  Documented NuGet HTTP protocol for public facing documentation website , enabling custom NuGet software",
      "•  Designed and helped implement asynchronous validation of packages",
      "•  Drove nuget.org redesign website to be fully accessible and have a fresh look",
      "•",
      "Implemented .NET Standard framework compatibilities in NuGet client",
      "Software Engineer I",
      "Microsoft Corp. – Commerce Platform",
      "May 2014 – Oct. 2015",
      "•  Maintained and improved paginated event store built on .NET and SQL Server",
      "•",
      "•",
      "Implemented generic REST endpoint which allows callers to efficiently poll for resource changes",
      "Implemented notification system built on .NET, SQL Server, and Azure Service Bus",
      "Software Development Engineer Intern",
      "Microsoft Corp. – Commerce Platform",
      "•  Worked on the order management system for Microsoft’s internal commerce platform",
      "Applications Developer Intern",
      "Space Exploration Technologies Corp. – IT",
      "May – Aug. 2013",
      "Jan. – May 2013",
      "•  Designed and developed an in-browser tool to edit sensor calibration files for the flight  software (C# + MVC 4)",
      "Software Development Engineer in Test (SDET) Intern",
      "Microsoft Corp. – Blend, Visual Studio team",
      "Mar. – Jun. 2012",
      "•  Wrote and debugged automated test cases in C# for Blend for Visual Studio (formerly Expression Blend)",
      "Development Intern",
      "Seapine Software, Inc.",
      "•  Worked on developing multi-platform bug tracking software in C++",
      "Engineering Intern",
      "ShareThis, Inc.",
      "Spring 2011, Fall 2011",
      "Summer 2008, Summer 2009",
      "•  Designed, developed, and deployed the ShareThis Firefox add-on (nearly 250,000 users)"
    ],
    "company_names": [
      "Microsoft"
    ],
    "no_of_pages": 1,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8dab10170921a743bf15"
  },
  "index": "SD_resume_9.pdf",
  "category": "software developer",
  "text": "shubham singh junior software developers shubh2014shiv 123 456 78 99 alabama professional summary junior software developer one plus year experience computer engineering seeking exciting educational opportunity organization grow professional work experience junior software developer virim infotech pvt ltd jan 2019 ongoing indore madhya pradesh created simulated stored procedure access data database developed web application hackathon event 24 hour wichacks 2017 integrated google map javascript locate event campus accessed database using mysql php junior software developer abc corp jan 2019 ongoing indore madhya pradesh worked team smart ais employee using cutting edge technology solve challenging business problem built elegant scalable extensible costeffective solution eye towards innovation agility utilized problemsolving decisionmaking skill understand client pain point self troubleshoot challenge arise education ms information science technology rochester institute technology jan 2019 ongoing new york information technology rajiv gandhi technical university jan 2019 ongoing location skills c javascript php xml achievements award achievements used resume job application professional prole demonstrate skill experience accomplishment",
  "parsed_resume": {
    "name": "S SHUBHAM",
    "email": "shubh2014shiv@gmail.com",
    "mobile_number": null,
    "skills": [
      "Xml",
      "Php",
      "Access",
      "Database",
      "Javascript",
      "Mysql",
      "Technical",
      "C++",
      "Engineering"
    ],
    "college_name": null,
    "degree": [
      "M.S. in information Science & Technology",
      "B.E. in information Technology"
    ],
    "designation": null,
    "experience": [
      "Junior Software Developer",
      "Virim Infotech Pvt, Ltd Jan / 2019 - Ongoing Indore, Madhya Pradesh",
      "• Created and simulated stored procedures to access data in the database.",
      "• Developed a web application in hackathon event of 24 hours - Wichacks 2017.",
      "• Integrated Google maps with Javascript to locate events on campus and accessed database using MySQL",
      "and PHP.",
      "Junior Software Developer",
      "ABC Corp Jan / 2019 - Ongoing Indore, Madhya Pradesh",
      "• Worked in a team with other smart AIS employees using cutting edge technologies to solve challenging",
      "business problems.",
      "• Built elegant, scalable, extensible, cost-effective solutions with an eye towards innovation and agility."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8dad10170921a743bf16"
  },
  "index": "SD_resume_1.pdf",
  "category": "software developer",
  "text": "resume ayush gupta ayushg3112 919013363330 skills languages java go javascript technologies docker kubernetes kafka nodejs spring boot rabbitmq aws redis grpc rest apis prometheus grafana databases postgresql mysql mongodb aws dynamodb sql server experience sde3 december 2022 present angel one bangalore india remote led team 5 engineer build core risk management platform trading platform p99 latency 25ms designed developed highperformance rule engine mitigating compliance margin shortfall risk engineered using go focused high performance correctness testing achieving submillisecond processing time defined mediumterm milestone execution plan multiyear initiative aligning project success longterm organizational goal improved performance scalability designing kafkabased communication system established monitoring alerting system prometheus grafana alertmanager senior software engineer september 2021 november 2022 gojek bangalore india remote managed 6person team develop automated central identity verification platform efficiently processing 100 document set per second across average 8 stage per set pioneered rabbitmq integration optimizing async workload replacing sidekiq increasing system maintainability reliability translated product initiative actionable engineering item efficient project execution designed endtoend architecture data flow diagram robust performance software engineer 2 august 2020 september 2021 postman bangalore india remote pioneered selfserve change management platform empowering team integrate version control transformed user story actionable task aligned business okrs optimized core product workflow 70 reducing error rate 80 senior software developer december 2018 august 2020 paisabazaar gurgaon india orchestrated mutual fund platform revamp driving key architectural decision managing transaction million dollar daily mailtoayushg3112 saved 30 operation team daily man hour automating previous manual task using incoming email parsing ui automation managed 200000 user migration zero downtime engaged stakeholder address bottleneck pain point reducing customer complaint 66 senior software engineer january 2018 december 2018 blocknomic technologies ltd gurgaon india led 3 engineer developing cryptocurrency exchange aggregator making crucial architectural decision led successful conversion html wireframes reactjs app conversion 2 week integrated public blockchains realtime transaction designed distributed realtime data aggregation system unified user data view established connection partner exchange crossplatform trading authored design document expediting new partner integration software engineer july 2016 december 2017 seraro solutions ltd noida india developed eventdriven iot tracking platform using serverless architecture aws service education guru gobind singh indraprastha university august 2012 june 2016 bachelors technology computer science engineering delhi india",
  "parsed_resume": {
    "name": "Ayush Gupta",
    "email": "AyushG3112@gmail.com",
    "mobile_number": "9013363330",
    "skills": [
      "System",
      "Java",
      "Sql",
      "Workflow",
      "Postgresql",
      "Aws",
      "Docker",
      "Compliance",
      "Automation",
      "Communication",
      "Apis",
      "Rest",
      "Operations",
      "Architecture",
      "Mysql",
      "Engineering",
      "Migration",
      "Ui",
      "Design",
      "Conversion",
      "Transactions",
      "Javascript",
      "Html",
      "Testing"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
      "December 2022 – Present",
      "SDE-3",
      "Angel One",
      "Bangalore, India (Remote)",
      "● Led a team of 5 engineers to build the core risk management platform for a trading platform",
      "with a P99 latency of 25ms.",
      "● Designed and developed a high-performance rule engine mitigating compliance and margin",
      "shortfall risks. Engineered using Go and focused on high performance and correctness",
      "testing, achieving a sub-millisecond processing time.",
      "● Defined medium-term milestones and execution plans for a multi-year initiative, aligning",
      "project success with long-term organizational goals.",
      "● Improved performance and scalability by designing a Kafka-based communication system.",
      "● Established a monitoring and alerting system with Prometheus, Grafana, and Alertmanager.",
      "Senior Software Engineer",
      "Gojek",
      "● Managed a 6-person team to develop an automated central identity verification platform,",
      "September 2021 – November 2022",
      "Bangalore, India (Remote)",
      "efficiently processing 100 document sets per second across an average of 8 stages per set.",
      "● Pioneered RabbitMQ integration, optimizing async workloads and replacing Sidekiq,",
      "increasing system maintainability and reliability.",
      "● Translated product initiatives into actionable engineering items for efficient project execution.",
      "● Designed end-to-end architecture and data flow diagrams for robust performance.",
      "Software Engineer 2",
      "Postman",
      "● Pioneered a self-serve change management platform, empowering teams to integrate with",
      "August 2020 – September 2021",
      "Bangalore, India (Remote)",
      "Version Control.",
      "● Transformed user stories into actionable tasks aligned with business OKRs.",
      "● Optimized core product workflow by 70%, reducing error rates by 80%.",
      "Senior Software Developer",
      "Paisabazaar",
      "● Orchestrated mutual funds platform revamp, driving key architectural decisions, managing",
      "December 2018 – August 2020",
      "Gurgaon, India",
      "transactions of millions of dollars daily.",
      "● Saved 30% operations' teams daily man hours by automating previous manual tasks using",
      "incoming e-mail parsing and UI automation.",
      "● Managed 200,000+ user migration with zero downtime.",
      "● Engaged with stakeholders to address bottlenecks and pain points, reducing customer",
      "complaints by 66%.",
      "Senior Software Engineer",
      "Blocknomic Technologies Ltd.",
      "● Led 3 engineers in developing a cryptocurrency exchange aggregator and making crucial",
      "January 2018 – December 2018",
      "Gurgaon, India",
      "architectural decisions.",
      "● Led the successful conversion of HTML wireframes to React.js app conversion in 2 weeks.",
      "● Integrated with public blockchains for real-time transactions.",
      "● Designed distributed, real-time data aggregation system for unified user data view.",
      "● Established connections with partner exchanges for cross-platform trading.",
      "● Authored design documents, expediting new partner integration.",
      "Software Engineer",
      "Seraro Solutions Ltd.",
      "● Developed an event-driven IoT tracking platform using serverless architecture and AWS",
      "July 2016 – December 2017",
      "Noida, India",
      "services."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 6.75
  }
},
{
  "_id": {
    "$oid": "649d8dae10170921a743bf17"
  },
  "index": "SD_resume_3.pdf",
  "category": "software developer",
  "text": "resume ayush gupta ayushg3112 919013363330 skills languages java go javascript technologies docker kubernetes kafka nodejs spring boot rabbitmq aws redis grpc rest apis prometheus grafana databases postgresql mysql mongodb aws dynamodb sql server experience sde3 december 2022 present angel one bangalore india remote led team 5 engineer build core risk management platform trading platform p99 latency 25ms designed developed highperformance rule engine mitigating compliance margin shortfall risk engineered using go focused high performance correctness testing achieving submillisecond processing time defined mediumterm milestone execution plan multiyear initiative aligning project success longterm organizational goal improved performance scalability designing kafkabased communication system established monitoring alerting system prometheus grafana alertmanager senior software engineer september 2021 november 2022 gojek bangalore india remote managed 6person team develop automated central identity verification platform efficiently processing 100 document set per second across average 8 stage per set pioneered rabbitmq integration optimizing async workload replacing sidekiq increasing system maintainability reliability translated product initiative actionable engineering item efficient project execution designed endtoend architecture data flow diagram robust performance software engineer 2 august 2020 september 2021 postman bangalore india remote pioneered selfserve change management platform empowering team integrate version control transformed user story actionable task aligned business okrs optimized core product workflow 70 reducing error rate 80 senior software developer december 2018 august 2020 paisabazaar gurgaon india orchestrated mutual fund platform revamp driving key architectural decision managing transaction million dollar daily mailtoayushg3112 saved 30 operation team daily man hour automating previous manual task using incoming email parsing ui automation managed 200000 user migration zero downtime engaged stakeholder address bottleneck pain point reducing customer complaint 66 senior software engineer january 2018 december 2018 blocknomic technologies ltd gurgaon india led 3 engineer developing cryptocurrency exchange aggregator making crucial architectural decision led successful conversion html wireframes reactjs app conversion 2 week integrated public blockchains realtime transaction designed distributed realtime data aggregation system unified user data view established connection partner exchange crossplatform trading authored design document expediting new partner integration software engineer july 2016 december 2017 seraro solutions ltd noida india developed eventdriven iot tracking platform using serverless architecture aws service education guru gobind singh indraprastha university august 2012 june 2016 bachelors technology computer science engineering delhi india",
  "parsed_resume": {
    "name": "Ayush Gupta",
    "email": "AyushG3112@gmail.com",
    "mobile_number": "9013363330",
    "skills": [
      "System",
      "Java",
      "Sql",
      "Workflow",
      "Postgresql",
      "Aws",
      "Docker",
      "Compliance",
      "Automation",
      "Communication",
      "Apis",
      "Rest",
      "Operations",
      "Architecture",
      "Mysql",
      "Engineering",
      "Migration",
      "Ui",
      "Design",
      "Conversion",
      "Transactions",
      "Javascript",
      "Html",
      "Testing"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
      "December 2022 – Present",
      "SDE-3",
      "Angel One",
      "Bangalore, India (Remote)",
      "● Led a team of 5 engineers to build the core risk management platform for a trading platform",
      "with a P99 latency of 25ms.",
      "● Designed and developed a high-performance rule engine mitigating compliance and margin",
      "shortfall risks. Engineered using Go and focused on high performance and correctness",
      "testing, achieving a sub-millisecond processing time.",
      "● Defined medium-term milestones and execution plans for a multi-year initiative, aligning",
      "project success with long-term organizational goals.",
      "● Improved performance and scalability by designing a Kafka-based communication system.",
      "● Established a monitoring and alerting system with Prometheus, Grafana, and Alertmanager.",
      "Senior Software Engineer",
      "Gojek",
      "● Managed a 6-person team to develop an automated central identity verification platform,",
      "September 2021 – November 2022",
      "Bangalore, India (Remote)",
      "efficiently processing 100 document sets per second across an average of 8 stages per set.",
      "● Pioneered RabbitMQ integration, optimizing async workloads and replacing Sidekiq,",
      "increasing system maintainability and reliability.",
      "● Translated product initiatives into actionable engineering items for efficient project execution.",
      "● Designed end-to-end architecture and data flow diagrams for robust performance.",
      "Software Engineer 2",
      "Postman",
      "● Pioneered a self-serve change management platform, empowering teams to integrate with",
      "August 2020 – September 2021",
      "Bangalore, India (Remote)",
      "Version Control.",
      "● Transformed user stories into actionable tasks aligned with business OKRs.",
      "● Optimized core product workflow by 70%, reducing error rates by 80%.",
      "Senior Software Developer",
      "Paisabazaar",
      "● Orchestrated mutual funds platform revamp, driving key architectural decisions, managing",
      "December 2018 – August 2020",
      "Gurgaon, India",
      "transactions of millions of dollars daily.",
      "● Saved 30% operations' teams daily man hours by automating previous manual tasks using",
      "incoming e-mail parsing and UI automation.",
      "● Managed 200,000+ user migration with zero downtime.",
      "● Engaged with stakeholders to address bottlenecks and pain points, reducing customer",
      "complaints by 66%.",
      "Senior Software Engineer",
      "Blocknomic Technologies Ltd.",
      "● Led 3 engineers in developing a cryptocurrency exchange aggregator and making crucial",
      "January 2018 – December 2018",
      "Gurgaon, India",
      "architectural decisions.",
      "● Led the successful conversion of HTML wireframes to React.js app conversion in 2 weeks.",
      "● Integrated with public blockchains for real-time transactions.",
      "● Designed distributed, real-time data aggregation system for unified user data view.",
      "● Established connections with partner exchanges for cross-platform trading.",
      "● Authored design documents, expediting new partner integration.",
      "Software Engineer",
      "Seraro Solutions Ltd.",
      "● Developed an event-driven IoT tracking platform using serverless architecture and AWS",
      "July 2016 – December 2017",
      "Noida, India",
      "services."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 6.75
  }
},
{
  "_id": {
    "$oid": "649d8db010170921a743bf18"
  },
  "index": "SD_resume_7.pdf",
  "category": "software developer",
  "text": "dipta das software engineer dipta670 1 2547179120 1825 3rd st waco tx 76706 usa passionate software engineer 2 year professional experience golang docker kubernetes pursuing msc computer science rd expertise microservice architecture code analysis java spring boot experience graduate research assistant baylor cloudhubs lab x august 2019 present waco tx usa uses java spring boot docker performed static code analysis spring boot project todetect rbac inconsistency code smell within programsource code bytecode developed backend managed productiondeployment virtual conference hosting site acm sac2020 intern researcher team lead red hat research x summer 2020 brno cz remote covid19 used java python led small team undergraduate student conduct researchon log analysis analyzed source code log red hat insights project toidentify execution path error event automated error debugging process utilizing externalknowledge source like stack overflow issue software engineer appscode inc x april 2017 april 2019 dhaka bangladesh used golang kubernetes docker grpc haproxy developed customresource crd controller kubernetesclusters extended stash project google cloud bucket azureblob storage integrating thirdparty opensourceproject restic improved ingress crd structure voyager project andintegrated haproxy hitless reload l4 l7 load balancing developed kubeci scratch achieve kubernetes nativeserverless platform workflowengine cicd systemintegrated kubeci facilitate gitops automated kubernetes cluster provisioning process vmsfor gcp aws ec2 azure digitalocean droplet implemented synchronization kubernetes configmaps andsecrets across multiple cluster kubed project wrote grpc based api server integrated monitoring forcontainers using prometheus metric grafana education msc computer science baylor university x aug 2019 present waco tx usa cgpa 390 thesis security analysis forcontainerized microservices bsc computer science eng chittagong university eng tech x 2012 2017 chittagong bd cgpa 359 thesis improving performanceof bkz lattice reduction algorithm skills java golang c python docker kubernetes spring boot postgres mysql mongodb grpc prometheus haproxy proud competitive programming divisional champion acm icpcdhaka regional 2014 2015 expert codeforces highestcontest rating 1707 open source contribution contributed 20 open sourceprojects implementing new featuresbug fixing issue reporting publications 5 article microservice security andcode analysis leadership worked lead developer ofvoyager stash kubeci opensourceprojects led small team log analysisproject collaboration red hat mailtodipta670 projects voyager voyager haproxy backed secure l7 l4 ingres controllerwith extended feature kubernetes usedwith kubernetes cloud provider including bare metal cluster extended core feature including haproxy hitless reload letsencrypt certificate integration ssl termination ssl passthroughtcp sni etc integrated oauth2 support authentication using facebook openid improved ingress crd structure better user experience stash stash cloudnative data backup recovery solution forkubernetes workload hood us restic backupand restore purpose extended opensource project restic support google cloudbucket azure blob storage improved volume backup implemented initial databasebackup system kubeci kubeci kubernetes native serverless platform workfloworchestrator cicd system developed kubeci scratch integrated kubeci facilitate gitops rad rad rest api discovery detects intermicroservice restcommunication perform software architecture reconstruction forum microservice mesh implemented rad scratch using bytecode analysis andextended using source code analysis utilized rad separate project rbac inconsistency andcode smell detection flarn flarn learning portal people age differentacademic background prepared initial design documentation performed feasibilityanalysis developed backend flarn project using spring boot wrote unit integration test integrated cicd pipeline andexecuted production deployment oss contributions kubernetes opensource system managingcontainerized application across multiplehosts restic backup program fast efficient andsecure helmcharts curated application kubernetes azure sdk go provides go package managing andusing azure service javassist java bytecode engineering toolkit gosh provides easy call shell golang publications das dipta et al 2021 automatedrbac assessment constructing acentralized perspective microservicemesh peerj computer science walker andrew dipta das andtomas cerny 2020 automatedcodesmell detection microservicesthrough static analysis case study applied sciences profiles  codeforces google scholar",
  "parsed_resume": {
    "name": "DIPTA DAS",
    "email": "dipta670@gmail.com",
    "mobile_number": "254-717-9120",
    "skills": [
      "Servers",
      "System",
      "Java",
      "Aws",
      "Api",
      "Docker",
      "Security",
      "Reporting",
      "C++",
      "Research",
      "Communication",
      "Github",
      "Computer science",
      "Sh",
      "Rest",
      "Debugging",
      "Metrics",
      "Shell",
      "Database",
      "Analysis",
      "Architecture",
      "Programming",
      "Facebook",
      "Mysql",
      "Process",
      "Cloud",
      "Engineering",
      "Python",
      "Design",
      "Documentation"
    ],
    "college_name": null,
    "degree": [
      "M.Sc. in Computer Science",
      "B.Sc. in Computer Science and Eng"
    ],
    "designation": [
      "Graduate Research Assistant",
      "Team Lead",
      "Software Engineer"
    ],
    "experience": [
      "Graduate Research Assistant",
      "Baylor Cloudhubs Lab",
      "x August 2019 – Present",
      "Uses: Java, Spring Boot, Docker",
      "( Waco, TX, USA"
    ],
    "company_names": [
      "Baylor Cloudhubs Lab\nx August 2019 – Present",
      "Stash"
    ],
    "no_of_pages": 2,
    "total_experience": 3.83
  }
},
{
  "_id": {
    "$oid": "649d8db110170921a743bf19"
  },
  "index": "PM_resume_1.pdf",
  "category": "product manager",
  "text": "kiran kumar parasa 1234 apple street pune maharashtra 411001 phone 911234567890 email yourname  objective accomplished product manager demonstrated history managing endtoend product planning execution throughout product lifecycle adept identifying area growth creating strategic product line roadmaps drive adoption excellent leadership analytical skill aiming utilize expertise efficiently manage product development strategically contribute company growth success skills extensive experience product planning execution proficient developing implementing product strategy expert market research competitive analysis proven leadership team management ability strong proficiency critical thinking problemsolving analytical skill experience ab testing data analysis product roadmap development knowledge agile methodology proficiency windows microsoft office fluent hindi english work experience product manager corporate digital banking dream jobs staffing solution pvt ltd noida uttar pradesh april 2015 current managed product development process implemented product strategy line company vision conducted market research competitive analysis shape product requirement feature identified area growth created strategic product line roadmaps drive adoption led effort integrate application leading industry system served inhouse expert product addressed functional issue mailtoyourname product manager accurate background mumbai maharashtra october 2009 august 2014 managed overall product roadmap met critical milestone deliverable provided guidance technology group development design artifact quality assurance test plan owned managed endtoend crossfunctional project including product definition roadmap resource planning understood mapped client requirementsenhancements product conducted requirement analysis education master engineering data science galgotia educational institutions ghaziabad uttar pradesh completed july 2008 certifications product manager certification pmc 2010 personal interests reading data management cycling sketching references available upon request",
  "parsed_resume": {
    "name": "Kiran Kumar",
    "email": "YourName@gmail.com",
    "mobile_number": "1234567890",
    "skills": [
      "Data analysis",
      "Certification",
      "Email",
      "English",
      "Design",
      "Lifecycle",
      "Market research",
      "Analytical skills",
      "Analysis",
      "Agile",
      "Product development",
      "Testing",
      "Windows",
      "Analytical",
      "Process",
      "Research",
      "Banking",
      "Engineering"
    ],
    "college_name": null,
    "degree": [
      "Master of Engineering in Data Science - GalgotiaEducational\nInstitutions,Ghaziabad,UttarPradesh(Completed,July2008)"
    ],
    "designation": [
      "Product Manager"
    ],
    "experience": [
      "Product Manager - Corporate Digital Banking - DreamJobs",
      "StaffingSolutionPvt.Ltd,Noida,UttarPradesh(April2015-Current)",
      "Managed the product development process and implemented product",
      "strategies in line with company vision.",
      "Conducted market research and competitive analysis to shape product",
      "requirements and features.",
      "Identified areas for growth and created strategic product line roadmaps to",
      "drive adoption.",
      "Led the effort to integrate our applications with other leading industry",
      "systems.",
      "Served as an in-house expert for our products and addressed functional",
      "issues.",
      "Product Manager - AccurateBackground,Mumbai,Maharashtra",
      "(October2009-August2014)",
      "Managed the overall product roadmap and met critical milestones and",
      "deliverables.",
      "Provided guidance to technology groups in the development of design",
      "artifacts & quality assurance test plans.",
      "Owned and managed end-to-end cross-functional projects, including",
      "product definition, roadmap & resource planning.",
      "Understood & mapped client’s requirements/enhancements for the product",
      "and conducted requirement analysis."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8db210170921a743bf1a"
  },
  "index": "ML_resume_5.pdf",
  "category": "machine learning",
  "text": "meschiaricv data science leader work crossfunctionally create evolve deliver data science solution practical usable trustworthy ensure success fostering alignment across product design engineering tearing communication barrier semantic gap advocating customer value lead team full research development lifecycle supporting individual professional growth skills machine learning supervised unsupervised classification regression highperformance statistical numerical method time series analysis forecasting data science engineering architecting highvolume etl machine learning pipeline aws emr using spark sparkml h2o building component mvp production using r scala python sql javascript java c creating interactive tool reproducible research report companywide consumption leadership mentoring junior senior position scoping complex task evaluating risk impact acting data advocate across multiple team researching knotty problem curiosity rigor designing technical interview explaining complex concept stakeholder clarity empathy creating knowledge value via clear presentation technical report workshop recent work experience stefano meschiari phd senior technical lead oct 2021 dec 2021 technical lead may 2019 nov 2021 senior data scientist jul 2017 may 2019 duo security cisco led research development data science platform power duo trust monitor demo duos threat detection solution collaborated product design team seamlessly integrate machine learning effective data presentation duos product prioritizing usability customer trust worked closely customer understand use case validate new capability coordinated data science engineering work ensure alignment manage expectation hit delivery milestone led team growth 1 10 ic member navigating substantial organizational change mentored 5 peer data science engineering served interim manager multiple data team required developed technical interview research algorithm ml architecture researched supervised unsupervised algorithm tailored security domain focusing simplicity explainability scalability worked domain expert translate cybersecurity knowledge expert rule heuristic layer complement ml model developed etl ml infrastructure process data build model surface threat authentication anomaly scale created report dashboard prototype guided technical ux decision delivered presentation demo training internally engineering sale vplevel executive externally submitted 2 patent uspto including firstinventor patent proprietary ml algorithm threat detection mailtostefanomeschiari mailtostefanomeschiari mailtostefanomeschiari mailtostefanomeschiari mailtostefanomeschiari mailtostefanomeschiari mailtostefanomeschiari education doctor philosophy astronomy astrophysics 2012 university california santa cruz received class year prize highest achievement research coursework teaching master science astronomy highest honor 2006 university bologna published 8 firstauthor refereed publication time series analysis optimization physical simulation cited 437 time total 17 refereed publication cited 1444 time contact website email stefanomeschiari  reference contact information available upon request product data scientist feb 2016 jun 2017 civitas learning created improved machine learning pipeline tooling model university student outcome improved custom modeling platform reducing batch training scoring running time cloud cost half developed new ml model custom classification algorithm r caret sparkml javascript backend data apis internal service developed application surfaced institutionlevel insight visualization empowering sales executive timely data driven talking point facilitating new partnership upsells wj mcdonald postdoctoral fellowship 2012 2016 savepoint principal investigator ut seed program 20142016 university texas austin researcher divided time conducting research theoretical astrophysics exoplanet detection building opensource library tooling astronomical community devising apps game astronomy education curriculum led data analysis effort lickcarnegie science collaboration 20 scientist across united states analyzed high value time series data captured keck apf lick telescope created ide library modeling data systemic used discover 40 new planetary system multiple team developed highperformance highly parallelized code package simulate planetary formation ut supercomputer cluster funded develop two educational application super planet crash played 15 million time covered verge io9 huffington post others systemic live used caltech uf ut mit sjsu yale columbia coursera teach student data analysis modeling mailtostefanomeschiari",
  "parsed_resume": {
    "name": "Stefano Meschiari",
    "email": "stefano.meschiari@gmail.com",
    "mobile_number": "014-2016",
    "skills": [
      "Data analysis",
      "Usability",
      "Email",
      "Java",
      "Forecasting",
      "Sql",
      "Scala",
      "Presentations",
      "Aws",
      "Teaching",
      "Etl",
      "Security",
      "R",
      "Mvp",
      "Research",
      "Communication",
      "Cisco",
      "Apis",
      "Github",
      "Lifecycle",
      "Algorithms",
      "Analysis",
      "Architecture",
      "Technical",
      "Process",
      "Cloud",
      "Engineering",
      "Python",
      "Machine learning",
      "Ux",
      "Researching",
      "Reports",
      "Design",
      "Interactive",
      "Training",
      "Javascript",
      "Modeling",
      "Partnerships",
      "Sales",
      "Website",
      "Presentation",
      "Spark"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
      "SENIOR TECHNICAL",
      "LEAD",
      "Oct 2021 - Dec 2021",
      "TECHNICAL LEAD",
      "May 2019 - Nov 2021",
      "SENIOR DATA",
      "SCIENTIST",
      "Jul 2017 - May 2019",
      "Duo Security (Cisco)",
      "• Led  the  research  and  development  of  the  data  science  platform  that",
      "powers Duo Trust Monitor (demo), Duo’s threat detection solution.",
      "• Collaborated  with  Product  and  Design  teams  to  seamlessly  integrate",
      "machine  learning  and  effective  data  presentation  into  Duo’s  product,",
      "prioritizing usability and customer trust. Worked closely with customers",
      "to understand their use cases and validate new capabilities.",
      "• Coordinated  Data  Science  and  Engineering  work  to  ensure  alignment,",
      "manage expectations, and hit delivery milestones.",
      "• Led  team  through  growth  from  1  to  10  IC  members,  navigating",
      "substantial organizational change. Mentored 5 peers in data science and",
      "engineering.  Served  as  interim  manager  for  multiple  data  teams  as",
      "required.  Developed  technical  interviews  on  research,  algorithms,  and",
      "ML architecture.",
      "• Researched  supervised  and  unsupervised  algorithms  tailored  to  the",
      "security domain, focusing on simplicity, explainability, and scalability.",
      "• Worked  with  domain  experts  to  translate  cybersecurity  knowledge  into",
      "expert rules and heuristic layers that complement ML models.",
      "• Developed ETL and ML infrastructure to process data, build models, and",
      "surface threats and authentication anomalies at scale.",
      "• Created reports, dashboards, and prototypes that guided technical and",
      "UX  decisions.  Delivered  presentations,  demos,  and  trainings  internally",
      "(for engineering, sales, and VP-level executives) and externally.",
      "• Submitted 2 patents to USPTO, including a first-inventor patent for our",
      "proprietary ML algorithm for threat detection.",
      "PRODUCT DATA",
      "SCIENTIST",
      "Feb 2016 - Jun 2017",
      "W.J. MCDONALD",
      "POSTDOCTORAL",
      "FELLOWSHIP",
      "2012 - 2016",
      "SAVE/POINT,",
      "PRINCIPAL",
      "INVESTIGATOR (UT",
      "SEED PROGRAM)",
      "2014-2016",
      "Civitas Learning",
      "• Created  and  improved  on  machine  learning  pipelines  and  tooling  to",
      "model  university    student  outcomes.  Improved  the  custom  modeling",
      "platform,  reducing  batch  training  and  scoring  running  time  and  cloud",
      "costs by half.",
      "• Developed new ML models and custom classification algorithms (in R/",
      "Caret,  SparkML,  and  JavaScript)  and  back-end  data  APIs  for  internal",
      "services.",
      "• Developed  applications  that  surfaced  institution-level  insights  and",
      "visualizations,  empowering  Sales  and  executives  with  timely  data-",
      "driven talking points and facilitating new partnerships and upsells.",
      "University of Texas at Austin",
      "As  a  researcher,  I  divided  my  time  between  conducting  research  in",
      "theoretical  astrophysics  and  exoplanet  detection,  building  open-source",
      "libraries and tooling for the astronomical community, and devising apps and"
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 5.83
  }
},
{
  "_id": {
    "$oid": "649d8db410170921a743bf1b"
  },
  "index": "ML_resume_4.pdf",
  "category": "machine learning",
  "text": "data sciencemachine learning resume name phone email waltham summary phd candidate mathematics department brandeis university expected graduate june 2022 conducted research theoretical practical machine learning including graph neural networks computer vision also experience data mining natural language processing haveprevious industry experience working bytedance advertising monetization proficient python tensorflow pytorch data structure algorithm actively seeking fulltime position machine learning data science skills proficient python tensorflow pytorch algorithm data structure familiar hadoop sql java language chinese native education brandeis university waltham usa august 2017 present phd candidate department mathematics relevant courses optimization algorithm data structure numerical methods scientific computing statistical machine learning data mining statistical approaches natural language processing graph mining award outstanding graduate teaching award capital normal university beijing china september 2014 june 2017 master science department mathematics award national scholarship transnational law business university seoul korea september 2009 june 2011 master international law wuhan university wuhan china sept 2005 june 2009 bachelor law industry experience internship bytedance advertising monetization beijing china june 2021 september 2021 extracted conversion related feature advertising system multiple app product using hadoop incorporated din deep interest network deepfm implemented tensorflow trained model using sequence feature boost cvr prediction auc increasing 1 data projects acm recsys challenge 2019 ranked 103 among 575 team built recommendation system predict clicked hotel user session based popularity score hotel order action user neural network parser built encoderdecoder model based nmt tensorflow neural machine translation train neural network parser penn treebank dataset pubg finish placement prediction kaggle competition ranked 11 among 1534 competitor predicted final placement final ingame stats 65000 game worth anonymized player data created feature engineering built lightgbm model used grid search cv algorithm turn hyperparameters research experience phd researcher department mathematics brandeis university convolutional networks phase information implemented efficient robust dnn model pytorch tackle object recognition replaced part traditional convolutional filter cnn trainable gabor filter contrast traditional filter constant number parameter made use phase information obtained wavelet fourier decomposition phase congruency phase symmetry particularly invariant illumination scale used detect edge corner learning guarantees graph convolutional networks presented provable guarantee one popular graph neural network model graph convolutional networks gcns semisupervised community detection task selected publications learning guarantees graph convolutional networks stochastic block model xxxxx review teaching mentoring experience mentor practicum spring 2021 fall 2019 coached new graduate student instructor teaching apprenticeship program provided written criticism consultation classroom teaching practice instructor ta 2018 2021 taught methods techniques calculus ta advanced calculus fourier analysis optimization introduction proofs evening tutoring program 2017 2018 worked tutor department evening tutoring program serf undergraduate student taking calculus",
  "parsed_resume": {
    "name": "Email Waltham",
    "email": null,
    "mobile_number": null,
    "skills": [
      "System",
      "Email",
      "Calculus",
      "Java",
      "Sql",
      "Mathematics",
      "Teaching",
      "Tensorflow",
      "Hadoop",
      "Parser",
      "Advertising",
      "Research",
      "Hotels",
      "Algorithms",
      "Analysis",
      "International",
      "Mining",
      "Engineering",
      "Python",
      "Machine learning",
      "Hotel",
      "Conversion",
      "Pytorch"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
      "Mentor of Practicum Spring 2021, Fall 2019",
      "● Coached new graduate student instructors in Teaching Apprenticeship Program, provided",
      "written criticism of and consultation on classroom teaching practices",
      "Instructor and TA 2018 - 2021",
      "● Taught: Methods and Techniques of Calculus; TA: Advanced Calculus and Fourier Analysis,",
      "Optimization and Introduction to Proofs",
      "Evening Tutoring Program 2017 - 2018",
      "● Worked as tutor in the department’s evening tutoring program, which serves undergraduate",
      "students taking calculus"
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8db510170921a743bf1c"
  },
  "index": "ML_resume_2.pdf",
  "category": "machine learning",
  "text": "1 tung thanh le website us permanent residency mobile phone 6124903605 personal email ttungl v education university louisiana lafayette usa doctor philosophy phd computer science 082013 122018 university louisiana lafayette usa master science msc computer science 082013 122016 kumoh national institute technology south korea master engineering meng convergence engineering 092011 082013 danang university technology vietnam bachelor engineering beng electrical engineering 082002 082007 v professional work experience v interest lead machine learning engineer thomson reuters 52023 present algorithmic optimization mathematical modeling machine learning big data deep learning artificial intelligence senior data scientist nbcuniversal 122021 42023 lift measurements goal measure impact advertising campaign responsible building etl data pipeline python pyspark sql databricks snowpark data processing feature engineering feature selection using matching method propensity score matching measuring impact multitouch attribution models goal determine channel high contribution conversion viewerscustomers therefore advising advertiser reallocate investment maximize return investment roi via optimization modeling responsible building endtoend mta optimization model determine impact advertising channel term contribution conversion customer journey face recognition goal help data labeling celebrity facesbrand object advertising video clip conducting analysis contributed high salesconversion rate advertising campaign responsible building model using mtcnn facenet svm mtcnn used capture facial area input faces captured used training facenet svm used classify new face based face embedding trained facenet model implemented aws ec2 deep learning instance data scientist jd power 072018 122021 daystoturn vehicles prediction goal help oemdealers planning optimally restock sale inventory based daystoturn prediction responsible building predictive model using data analytics machine learning predict daystoturn target determines long take sell specific new car inventory implemented aws databricks using python sql tableau streamlit dashboard pin transformation building etl big data pipeline sas python using bigquery pyspark python javascript production aws gcp platform online social review analytics goal help evaluating instore performance rating based customer review bank across us responsible building review sentiment analysis using natural language processing nlp technique text cleaning feature engineering using outlier remover lemmatization ngrams tokenization utilizing aws comprehend sagemaker google cloud nlp research intern hanwha thales south korea 08302012 12312012 responsible optimizing network topology ship builtinnetwork communication summer intern orion technologies co south korea 06012012 08302012 responsible programming network communication ship software engineer unilabdut novas technologies ltd vietnam 04012008 06012011 responsible softwarehardware development pcb layout design engineer acronics systems inc san jose ca vietnam office 06012007 03302008 responsible designing pcb high speed circuit board v projects donation analytics insight data engineering challenge data engineer working political consultant whose client cashstrapped political candidate theyve asked help analyzing loyalty trend campaign contribution namely identifying area repeat donor calculating much theyre spending identify area zip code could source repeat campaign contribution behavioral cloning deep learning built trained convolutional neural network drive car autonomously simulator using tensorflow backend keras experimented modified nvidia architecture performed image processing brightness shadow augmentation flipped image using opencv used dropout adam optimizer generalize network driving multiple track used udacitys dataset training model trained model amazon aws ec2 creating customer segments evaluated type customer wholesale distributor help make better informed business decision change customer used unsupervised learning technique kmeans clustering observe similarity exist customer networkonchip optimization designed mathematical modeling optimizing interconnection energy efficiency networkonchip used cplex gurobi solver python pyomo matlab heuristic algorithm machine learning algorithm solving optimization problem v professional certificates certification machine learning 2017 online course stanford university certification statistical learning 2018 online course stanford university certification natural language processing specialization 2021 online course deeplearningai data analytics methods marketing 2022 online course meta v honors awards graduate teaching assistantship 092015 062018 nsf graduate research fellowship 092013 082015 best paper award 14th conference electronics info communications 2012 nipa scholarship nrf scholarship south korea 092011 062013 samsung thales scholarship student travel 122012 excellent student danang university technology 2004 2007 one four honor student achieving highest score graduation thesis 4500 2007 v computer skills programming language python java pyspark scala bigquery javascripts sql cc r matlab cplexampl frameworkslibraries databricks airflow tensorflow keras apache spark snowflake snowpark mllib nodejs opencv scikit learn pytorch spacy nltk openai aws product h2oai driverless ai platform trax google data visualization tableau power bi cloud services amazon aws google cloud platform",
  "parsed_resume": {
    "name": "Tung Thanh",
    "email": "ttungl@gmail.com",
    "mobile_number": "612-490-3605",
    "skills": [
      "Jose",
      "Brand",
      "Email",
      "Java",
      "Electrical engineering",
      "Sql",
      "Scala",
      "Tableau",
      "Video",
      "Spacy",
      "Aws",
      "Teaching",
      "Tensorflow",
      "Analytics",
      "Etl",
      "Electronics",
      "Advertising",
      "Marketing",
      "R",
      "Electrical",
      "C++",
      "Research",
      "Communication",
      "Pyspark",
      "Computer science",
      "Certification",
      "Ai",
      "Sas",
      "Algorithms",
      "Analysis",
      "Inventory",
      "Programming",
      "Architecture",
      "Big data",
      "Data analytics",
      "Mobile",
      "Cloud",
      "Engineering",
      "Python",
      "Keras",
      "Matlab",
      "Travel",
      "Machine learning",
      "Design",
      "Training",
      "Nltk",
      "Conversion",
      "C",
      "Javascript",
      "Opencv",
      "Modeling",
      "Website",
      "Sales",
      "Pytorch",
      "Spark",
      "Hardware"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
      "§",
      "Lead Machine Learning Engineer",
      "Thomson Reuters",
      "5/2023 – Present",
      "Senior Data Scientist",
      "NBCUniversal    12/2021 – 4/2023",
      "§",
      "Mobile Phone: 612-490-3605",
      "Personal Email: ttungl@gmail.com",
      "§",
      "§",
      "v",
      "University of Louisiana at Lafayette, USA",
      "Master of Science (M.Sc.) in Computer Science",
      "08/2013 – 12/2016",
      "Danang University of Technology, Vietnam",
      "Bachelor of Engineering (B.Eng.) in Electrical Engineering,",
      "08/2002 – 08/2007",
      "Interest",
      "§",
      "Algorithmic Optimization, Mathematical Modeling",
      "§  Machine Learning, Big Data, Deep Learning and Artificial",
      "Intelligence",
      "§",
      "Lift  Measurements:  The  goal  is  to  measure  the  impact  of  advertising  campaigns.  Responsible  for  building  ETL  data  pipelines  with  Python,  PySpark,  SQL  on",
      "Databricks and SnowPark for data processing, feature engineering, feature selection, using matching methods such as propensity score matching for measuring",
      "the impact.",
      "§  Multi-Touch Attribution Models: The goal is to determine which channels have high contribution to the conversion of the viewers/customers, therefore advising",
      "advertisers to reallocate their investment to maximize their return on investment (ROI) via optimization modeling. Responsible for building the end-to-end MTA",
      "and Optimization models to determine the impact of advertising channels in terms of their contributions to the conversions for customer journey.",
      "Face Recognition: The goal is to help data labeling on celebrity faces/brand objects in advertising video clips for conducting analysis on who contributed high",
      "sales/conversion rates in the advertising campaigns. Responsible for building the model using MTCNN, FaceNet, and SVM. MTCNN is used to capture facial areas",
      "from inputs. Faces captured are used for training FaceNet. SVM is used to classify new faces based on Face Embedding from trained FaceNet model. Implemented",
      "on AWS EC2 Deep Learning instance.",
      "§",
      "§",
      "Data Scientist",
      "J.D. POWER   07/2018 – 12/2021",
      "§",
      "§",
      "§",
      "Days-to-turn on Vehicles Prediction: The goal is to help the OEM/dealers planning to optimally re-stock their sales inventories based on days-to-turn prediction.",
      "Responsible for building predictive models using data analytics, machine learning to predict days-to-turn target which determines how long it takes to sell a specific",
      "new car in the inventory. Implemented on AWS and databricks using Python and SQL, and Tableau and Streamlit for dashboards.",
      "PIN Transformation: Building ETL big data pipelines from SAS to Python using BigQuery, PySpark, Python, Javascript for production on AWS, GCP platforms.",
      "Online  Social  Review  Analytics:  The  goal  is  to  help  evaluating  the  in-store  performance  rating  based  on  the  customers’  reviews  of  the  banks  across  U.S.",
      "Responsible for building the reviews sentiment analysis using natural language processing (NLP) techniques such as text cleaning, feature engineering using outlier",
      "remover, lemmatization, N-grams tokenization; Utilizing AWS Comprehend, SageMaker, Google Cloud NLP.",
      "•",
      "§",
      "Research Intern",
      "Hanwha Thales, South Korea",
      "08/30/2012 – 12/31/2012:  Responsible for optimizing the network topologies for ships’",
      "built-in-network communication.",
      "Software Engineer",
      "Unilab-DUT (Novas Technologies Ltd.), Vietnam",
      "04/01/2008 – 06/01/2011:  Responsible for software-hardware development.",
      "§",
      "§",
      "Summer Intern",
      "Orion Technologies Co., South Korea",
      "06/01/2012 – 08/30/2012: Responsible for programming network",
      "communication in ships.",
      "PCB Layout & Design Engineer",
      "Acronics Systems, Inc – San Jose, CA (Vietnam office)",
      "06/01/2007 – 03/30/2008:  Responsible for designing PCB on high-",
      "speed circuit boards."
    ],
    "company_names": null,
    "no_of_pages": 1,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8db610170921a743bf1d"
  },
  "index": "ML_resume_3.pdf",
  "category": "machine learning",
  "text": "abdallah bashir 447493734669  london uk education saarland university saarbrucken de master science computer science university khartoum khartoum sd bachelor science electrical electronics engineering minor software engineering experience machine learning engineer aug 2022 goldman sachs london uk research implement novel machine learning deep learning algorithm model specialize nlp modeling utilizing llm text classification named entity recognition question answering semantic parsing uncertainty modeling lowresource domain deploy machine learning model production adhering strict constraint around model size training runtime latency design maintain deployment pipeline including continuous integration delivery version control monitoring balance model accuracy efficiency business operational requirement possess technical expertise nlp modeling project management skill deep understanding business operational constraint applied scientist intern apr 2022 jul 2022 amazon seattle usa using transformers based model implemented endtoend unsupervised framework identify sensitive trending topic alexa traffic achievements framework increase robustness online sensitive detection model alexa refining quality labeling data research intern jan 2022 mar 2022 allen institute artificial intelligence seattle usa conduct research natural language proceeding data augmentation using language model using lstms transformers implemented pipeline leverage model like albert bart extrapolate datasets strucured entites machine learning intern apr 2021 aug 2021 goldman sachs frankfurt de curate parse preprocess data related git project organization implementing deep learning model attention identify high risk change git software product achievements implemented machine learning based tool help code reviewer detect high risk change software product research assistant nov 2019 mar 2021 max planck institute informatics saarbrucken de conducting research integrating common sense neural language model implementing novel method integrate common sense knowledge language model implemented api parse preprocess json text data modeling built web scraper scrape medical scientific abstract applied nlp stateoftheart technique tokenizers model transfer learning medical domain using cnn lstms transformers achievements implemented model finetune language models like bert roberta named entity recognition text classification task 90 accuracy software engineer cofounder sep 2017 oct 2018 echonine solutions startup khartoum sd gathered defined customer requirement develop clear specification creating wellorganized project plan designed built monitored web mobile application continuous improvement achievements building product cooperation zain sudan top telecommunication company country projects healthy diet covid19 machine learning pythonr git data visualization april 2020 jul 2020 using machine learning project aim analyze food consumption country world see whether there relationship given country food habit recovery rate preprocessed data shape modeling implemented three machine learning model benchmarked result report best one built figure using visualization tool explain assumption made data managed team four deliver final project music synthesizer python pytorch language models streamlit git jan 2020 may 2020 using deep learning try generate pop classic music converting music note text train neural language model built api convert music midi file tokenized text implemented deep learning model trained music note text evaluated generated music getting insight expert using music theory test helped implementing demo project using streamlit whatsapp chatbot python flask deep learning transformers git mar 2020 apr 2020 designed built api integrate pretrained model chatbot integrated whatsapp api link twilio api whatsapp together flask web application framework handle sending receiving message whatsapp flask wep app designed link huggingface implementation dialogpt largescale pretrained dialogue response generation model multiturn conversation twilio api publications venues findings emnlp 2020 sep 2020 w nekoto et al participatory research lowresourced machine translation case study african languages arxiv201002353 c oct 2020 accessed oct 15 2020 online available venues iclr20 africanlp workshop mar 2020 bashir hassan b rosman duma ahmed implementation neural natural language understanding component arabic dialogue systems procedia computer science 142222229 jan 2018 venues acling18 neurips18 black ai workshop nov 2018 orife et al masakhane machine translation africa arxiv200311529 c mar 2020 accessed mar 29 2020 online available awards accomplishments wikimedia cowinner research award year apr 2021 acling awarded outstanding paper award nov 2018 university khartoum awarded scientific innovation award bsc thesis oct 2018 deep learning indaba awarded poster award sep 2018 indabax sudan coorganized led team indabax sudan apr 2018 tedx organized led team tedxyouthnilestreet reported press engaging event year oct 2016 skills machine learning deep learning natural language processing dialogue systems machine translation natural language understanding computer vision python r swift cc sql assembly htmlcss java pytorch tensorflow keras scikitlearn hugging face fastai django docker linux git flaskstreamlitmetaflow aws sagemaker pandas numpy matplotlib data analysis visualization data mining education experience projects publications awards accomplishments skills",
  "parsed_resume": {
    "name": "Abdallah Bashir",
    "email": "TEDxYouth@NileStreet",
    "mobile_number": "749-3734",
    "skills": [
      "Data analysis",
      "Datasets",
      "Improvement",
      "Java",
      "Sql",
      "Startup",
      "Swift",
      "Linux",
      "Aws",
      "Tensorflow",
      "Try",
      "Flask",
      "Api",
      "Docker",
      "Project management skills",
      "Electronics",
      "Json",
      "Numpy",
      "Continuous improvement",
      "Customer requirements",
      "R",
      "Electrical",
      "C++",
      "Research",
      "Specifications",
      "Ai",
      "Matplotlib",
      "Algorithms",
      "Analysis",
      "Analyze",
      "Assembly",
      "Technical",
      "Mining",
      "Mobile",
      "Keras",
      "Engineering",
      "Python",
      "Design",
      "Training",
      "Django",
      "C",
      "Css",
      "Modeling",
      "Html",
      "Pytorch",
      "Pandas"
    ],
    "college_name": null,
    "degree": null,
    "designation": [
      "Software Engineer",
      "Machine Learning Engineer"
    ],
    "experience": [
      "Machine Learning Engineer",
      "Goldman Sachs",
      "Saarbrucken, DE",
      "Khartoum, SD",
      "Aug 2022 – Now",
      "London, UK",
      "• Research and implement novel machine learning and deep learning algorithms and models.",
      "• Specialize in NLP modeling, utilizing LLM for text classification, named entity recognition, question answering,",
      "semantic parsing, and uncertainty modeling in low-resource domains.",
      "• Deploy machine learning models to production while adhering to strict constraints around model size, training, and",
      "runtime latency.",
      "• Design and maintain deployment pipelines, including continuous integration and delivery, version control, and",
      "monitoring.",
      "• Balance model accuracy and efficiency against business and operational requirements.",
      "• Possess technical expertise in NLP modeling, project management skills, and a deep understanding of business and",
      "operational constraints.",
      "Applied Scientist Intern",
      "Amazon",
      "Apr 2022 – Jul 2022",
      "Seattle, USA",
      "• Using Transformers based models, Implemented an end-to-end unsupervised framework to identify sensitive",
      "trending topics in Alexa traffic.",
      "• Achievements - the framework will increase the robustness of online sensitive detection models in Alexa by refining",
      "the quality of labeling data.",
      "Research Intern",
      "Allen Institute for Artificial Intelligence",
      "Jan 2022 – Mar 2022",
      "Seattle, USA",
      "• Conduct research in Natural Language Proceeding Data Augmentation using Language models using LSTMs and",
      "Transformers",
      "• Implemented pipelines that leverage models like Albert and BART to extrapolate datasets with strucured entites.",
      "Machine Learning Intern",
      "Goldman Sachs",
      "Apr 2021 – Aug 2021",
      "Frankfurt, DE"
    ],
    "company_names": null,
    "no_of_pages": 3,
    "total_experience": 0.75
  }
},
{
  "_id": {
    "$oid": "649d8db810170921a743bf1e"
  },
  "index": "ML_resume_6.pdf",
  "category": "machine learning",
  "text": "resume juan jose carin 1 2 juan jose carin data scientist mountain view ca 94041 6503364590 juanjosecarin cominjuanjosecarin juanjocarin professional profile passionate data analysis experiment mainly focused user behavior experience engagement solid background data science statistic extensive experience using data insight drive business growth education 2016 university california berkeley master information data science gpa 393 relevant course machine learning machine learning scale storing retrieving data field experiments applied regression time series analysis exploring analyzing data data visualization communication research design applications data analysis 2014 universidad politcnica de madrid ms statistical computational information processing gpa 369 relevant course data mining multivariate analysis time series neural networks statistical learning regression prediction methods optimization techniques monte carlo techniques numerical methods finance stochastic models finance bayesian networks 2005 universidad politcnica de madrid ms telecommunication engineering gpa 303 focus area radio communication system radar mobile fellowship first year university due honors obtained last year high school skills programming statistics big data visualization others proficient r python sql hadoop hive mrjob tableau git aws intermediate spss sas matlab spark storm bash basic eviews demetra d3js gephi neo4j qgis experience data science jan 2016 mar 2016 data scientist conento madrid spain working remotely designed implemented etl pipeline predictive model traffic main road eastern spain project spanish government automated script r extract transform clean incl anomaly detection load mysql data multiple data source road traffic sensor accident road work weather jun 2014 sep 2014 data scientist conento madrid spain designed experiment google spain conducted october 2014 measure impact youtube ad sale car manufacturer dealer network matchedpair clusterrandomized design involved selecting test control group sample 50 city spain geotargeted ad possible based sale wise similarity time using wavelet r management sales electrical eng feb 2009 aug 2013 head sales spain portugal test measurement dept yokogawa madrid spain applied analysis sale market trend decide direction department led team 7 people mailtojuanjosecarin 2 2 juan jose carin data scientist mountain view ca 94041 6503364590 juanjosecarin cominjuanjosecarin juanjocarin increased revenue 63 gross profit 42 operating income 146 achieved 30 ratio new customer 3x growth entering new market improving customer service training sales electrical eng  apr 2008 jan 2009 sales engineer test measurement dept yokogawa madrid spain promoted head sale 5 month leading sale team sep 2004 mar 2008 sales application engineer  madrid spain exceeded sale target every year 2005 2007 achieved 60 target first 3 month 2008 education jul 2002 jun 2004 tutor differential integral calculus physics digital electronic circuits academia universitaria madrid spain highestrated professor student survey 4 6 term increased ratio student passing course 25 projects see juanjocarin additional information 2016 smartcam capstone python opencv tensorflow aws ec2 s3 dynamodb scalable cloudbased video monitoring system feature motion detection face counting image recognition 2015 implementation shortest path pagerank algorithm wikipedia graph dataset machine learning scale hadoop mrjob python aws ec2 aws s3 using graph dataset almost half million node 2015 forest cover type prediction machine learning python scikitlearn matplotlib kaggle competition prediction predominant kind tree cover strictly cartographic variable elevation soil type using random forest svms knns naive bayes gradient descent gmms 2015 redefining job search process storing retrieving data hadoop hdfs hive spark python aws ec2 tableau pipeline combine data indeed api us census bureau select best location data scientist based number job posting housing cost etc 2015 fresh perspective citi bike data visualization communication tableau sqlite interactive website visualize nyc citi bike bicycle sharing service 2015 investigating effect competition ability solve arithmetic problem field experiments r randomized controlled trial 300 participant assigned control group one two test group evaluate effect competition compared one someone better worse 2014 prediction customer churn mobile network carrier data mining sas predictions sample 45000 customer using tree decision logistic regression neural network 2014 different model harmonized index consumer prices hicp spain time series spss demetra forecasts based exponential smoothing arima transfer function using petrol price independent variable model mailtojuanjosecarin",
  "parsed_resume": {
    "name": "Juan Jose",
    "email": "juanjose.carin@gmail.com",
    "mobile_number": "650-336-4590",
    "skills": [
      "Data analysis",
      "Jose",
      "System",
      "Calculus",
      "Experiments",
      "Sql",
      "Tableau",
      "Forecasts",
      "Video",
      "Radar",
      "Aws",
      "Tensorflow",
      "Hadoop",
      "Api",
      "Engagement",
      "Etl",
      "Physics",
      "Customer service",
      "R",
      "Statistics",
      "Electrical",
      "Research",
      "Communication",
      "Sas",
      "Matplotlib",
      "Algorithms",
      "Analysis",
      "Programming",
      "Mysql",
      "Mining",
      "Mrjob",
      "Process",
      "Mobile",
      "Cloud",
      "Engineering",
      "Python",
      "Machine learning",
      "Matlab",
      "Design",
      "Training",
      "Interactive",
      "Hive",
      "Finance",
      "Opencv",
      "Sales",
      "Telecom",
      "Circuits",
      "Website",
      "Spark",
      "Spanish"
    ],
    "college_name": null,
    "degree": null,
    "designation": [
      "Sales Engineer",
      "Sales & Application Engineer",
      "Head of Sales,",
      "MANAGEMENT – SALES"
    ],
    "experience": [
      "DATA SCIENCE",
      "Programming / Statistics",
      "R, Python, SQL",
      "SPSS, SAS, Matlab",
      "EViews, Demetra+",
      "Big Data",
      "Hadoop, Hive, MrJob",
      "Spark, Storm",
      "Visualization",
      "Tableau",
      "D3.js",
      "Others",
      "Git, AWS",
      "Bash",
      "Gephi, Neo4j, QGIS",
      "Jan. 2016 – Mar. 2016",
      "Jun. 2014 – Sep. 2014",
      "Data Scientist",
      "CONENTO",
      "Madrid, Spain (working remotely)",
      "•  Designed and implemented the ETL pipeline for a predictive model of traffic on the main roads in",
      "eastern Spain (a project for the Spanish government).",
      "•  Automated scripts in R to extract, transform, clean (incl. anomaly detection), and load into MySQL",
      "data from multiple data sources: road traffic sensors, accidents, road works, weather.",
      "Data Scientist",
      "CONENTO",
      "Madrid, Spain",
      "•  Designed an experiment for Google  Spain (conducted in October 2014) to measure the impact of",
      "YouTube ads on the sales of a car manufacturer's dealer network.",
      "•  A  matched-pair,  cluster-randomized  design,  which  involved  selecting  the  test  and  control  groups",
      "from a sample of 50+ cities in Spain (where geo-targeted ads were possible) based on their sales-",
      "wise similarity over time, using wavelets (and R).",
      "MANAGEMENT – SALES (Electrical Eng.)",
      "Feb. 2009 – Aug. 2013",
      "Head of Sales, Spain & Portugal – Test &Measurement dept.",
      "YOKOGAWA",
      "Madrid, Spain",
      "•  Applied analysis of sales and market trends to decide the direction of the department.",
      "•  Led a team of 7 people.",
      "1 of 2",
      "Juan Jose Carin",
      "Data Scientist",
      "Mountain View, CA 94041",
      "650-336-4590  |  juanjose.carin@gmail.com",
      "juanjocarin.github.io",
      "linkedin.com/in/juanjosecarin  |",
      "•  Increased revenue by 6.3%, gross profit by 4.2%, and operating income by 146%, and achieved a 30%",
      "ratio of new customers (3x growth), by entering new markets and improving customer service and",
      "training.",
      "SALES (Electrical Eng. & Telecom.)",
      "Apr. 2008 – Jan. 2009",
      "Sales Engineer – Test & Measurement dept.",
      "YOKOGAWA",
      "•  Promoted to head of sales after 5 months leading the sales team.",
      "Madrid, Spain",
      "Sep. 2004 – Mar. 2008",
      "Sales & Application Engineer",
      "AYSCOM",
      "Madrid, Spain",
      "•  Exceeded sales target every year from 2005 to 2007 (achieved 60% of the target in the first 3 months",
      "of 2008)."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8db910170921a743bf1f"
  },
  "index": "ML_resume_1.pdf",
  "category": "machine learning",
  "text": "yunlong jiao machine learning scientist london uk sponsorship needed 44 7400 724281 yljiaoustc cominyunlongjiao currently machine learning scientist amazonalexa working building ai assistant able replicate human intelligence ampassionate appliedai research drive tangible impact product service 5 year postphd experience field ofmlai posse strong skill model development performance evaluation proficient python deep learning framework successfully incubating delivering multiple project amazon involved phase development cycle building proof concept delivering minimum viable product scaling production experience supervising master thesis research internship well coaching mentoring junior teammembers education 2013 2017 doctor philosophy centre computational biology paris sciences et lettres psl research university paris france 2012 2013 master science mention trs bien department mathematics university parissaclay orsay france 2008 2012 bachelor science first class honours department mathematics university science technology china hefei china work experience machine learning scientist current nov 2019 amazon london uk key skills natural language processing large language models deep generative models neural texttospeech alexa shopping science team frommar 2021 current responsibility 1 leading research bias mitigation technology nlp enhance fairness preserving user privacy 2 building deployingml solution creating unified user experience alexa shopping across different device 3 working crossfunctional team overseeing prototype production communicating result stakeholder 4 supervising research internship coaching mentoring junior teammembers alexa texttospeech research team nov 2019 feb 2021 1 proposed delivered deep generative model universal speech synthesis used regardless speaker identity language therefore massively save cost tts production speed launch new tts voice 2 collaboratedwith engineer scale upalexa tts production launch new voice inmultiple region country postdoctoral research scientist nov 2017 oct 2019 university oxford oxford uk key skills gaussian processes time series forecasting multimodality responsibility included 1 leading oxford research multiorganizational project involving organization uk eu developing novel method longitudinal modelling complex disease using multimodal data integration 2 supervising master thesis department statistics doctoral researcher sep 2013 sep 2017 psl research university paris france key skills kernel methods representation learning graph learning sparsity regularisation phdwork contributed novel mlmethods advanced scientific discovery biology cancer research mailtoyljiaoustc 1 research focus kernel method representation learning nontabular data rank data graph 2 research output significantly improved prediction breast cancer survival using genetic data guided inter pretable biomarker discovery help biological network 3 published multiple firstauthored paper top ml conference journal 3 icml 1 ieee tpami developed opensource toolkits colleague participated finally placed 2nd dreamtoxicogenetics challenge kagglestyle com munity competition data science aimed advance computational method biology data scientist intern apr 2015 jun 2015 roche diagnostics gmbh penzberg germany key skills information extraction feature engineering largescale unstructured database internship 1 proposed data pipeline process largescale unstructured machinery performance data built model predict failure state automated immunoassay analyser 2 demonstrated howmaintenance efficiency greatly improved one roches core hardware product mywork direct impact strengthening customer trust innovative solution patented roche technical skills programming python numpy panda scikitlearn deep learning frameworks pytorch mxnet r cc big data accelerated computing cuda cloud computing aws sagemaker sql devops bash git docker open source unitintegration testing cicd professional skills communication experienced speaker international conference workshop confident presenting project idea result peer leadership stakeholder mentoring coaching research intern junior teammembers writing proficient academic writing providing guidance earlystage researcher writing experienced leading rd proposal producing technical report milestone delivery project management capable tech lead research project trusted crossfunctional team collaboration knowledgeable principle agile development skilled working scrum team languages chinese native english bilingual spanish conversational french reading selected publications patents f liu jiao j massiah e yilmaz havrylov transencoder unsupervised sentencepair modelling self mutualdistillations iclr 2022 agabryy jiao v klimkov korzekwa r barrachicote improving expressiveness neural vocoding non affine normalizing flows interspeech 2021 jiao gabry g tinchev b putrycz korzekwa v klimkov universal neural vocoding parallel wavenet icassp 2021 f heinemann kobel dahlmanns jp vert jiao failure state prediction automated analyzers analyzing biological sample us patent app 2019 jiao jp vert theweighted kendall highorder kernels permutations icml 2018 jiao korba e sibony controlling distance kemeny consensus without computing icml 2016 jiao jp vert kendall andmallows kernels permutations icml 2015 education work experience technical skills professional skills selected publications patents",
  "parsed_resume": {
    "name": "Yunlong Jiao",
    "email": "yljiao.ustc@gmail.com",
    "mobile_number": "400 7242",
    "skills": [
      "Supervising",
      "Forecasting",
      "Sql",
      "Research projects",
      "Agile",
      "Mathematics",
      "Biology",
      "French",
      "Aws",
      "Open source",
      "Writing",
      "Docker",
      "Numpy",
      "R",
      "Statistics",
      "C++",
      "Scrum",
      "Research",
      "Communication",
      "Prototype",
      "Ai",
      "Database",
      "Programming",
      "Mxnet",
      "International",
      "Technical",
      "Process",
      "Cloud",
      "Engineering",
      "Python",
      "Reports",
      "English",
      "Coaching",
      "C",
      "Pandas",
      "Pytorch",
      "Testing",
      "Hardware",
      "Spanish"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
      "Machine Learning Scientist",
      "Amazon, London, UK",
      "■ Key Skills: Natural Language Processing, Large Language Models, Deep Generative Models, Neural Text-to-Speech",
      "■ At Alexa Shopping Science team (from Mar 2021), my current responsibilities are:",
      "Current, from Nov 2019",
      "1) Leading research on bias mitigation technologies in NLP to enhance fairness while preserving user privacy;",
      "2) Building and deploying ML solutions in creating unified user experiences for Alexa Shopping across different devices;",
      "3) Working in cross-functional teams, overseeing prototype to production, and communicating results with stakeholders;",
      "4) Supervising research internships and coaching and mentoring junior team members.",
      "■ At Alexa Text-to-Speech Research team (Nov 2019 – Feb 2021), I had:",
      "1) Proposed and delivered a deep generative model for ‘universal’ speech synthesis, which can be used regardless of speaker",
      "identity or language and can therefore massively save cost in TTS production and speed up launch of new TTS voices;",
      "2) Collaborated with engineers to scale up Alexa TTS production and launch new voices in multiple regions and countries.",
      "Postdoctoral Research Scientist",
      "University of Oxford, Oxford, UK",
      "■ Key Skills: Gaussian Processes, Time Series Forecasting, Multi-modality",
      "■ My responsibilities included:",
      "Nov 2017 – Oct 2019",
      "1) Leading Oxford research in a multi-organizational project (involving organizations in the UK and EU) and developing",
      "novel methods for longitudinal modelling of complex disease using multi-modal data integration;",
      "2) Supervising master’s theses in the Department of Statistics.",
      "Doctoral Researcher",
      "PSL Research University, Paris, France",
      "■ Key Skills: Kernel Methods, Representation Learning, Graph Learning, Sparsity Regularisation",
      "■ My PhD work contributed novel ML methods and advanced scientific discoveries in biology and cancer research:",
      "Sep 2013 – Sep 2017",
      "1) My research focus was kernel methods and representation learning of non-tabular data, such as rank data and graphs.",
      "2) My research outputs significantly improved prediction of breast cancer survival using genetic data, and guided inter-",
      "pretable biomarker discovery with the help of biological networks.",
      "3) I had published multiple first-authored papers in top ML conferences and journals (3 at ICML and 1 at IEEE TPAMI)",
      "and developed open-source toolkits.",
      "■ A few colleagues and I participated, and finally placed 2nd, in the DREAM Toxicogenetics Challenge, a Kaggle-style com-",
      "munity competition in data science that is aimed to advance computational methods in biology.",
      "Data Scientist Intern",
      "Roche Diagnostics GmbH, Penzberg, Germany",
      "■ Key Skills: Information Extraction, Feature Engineering, Large-Scale Unstructured Database",
      "■ During the internship, I had:",
      "Apr 2015 – Jun 2015",
      "1) Proposed a data pipeline to process large-scale unstructured machinery performance data and built a model to predict",
      "failure state for automated immunoassay analysers;",
      "2) Demonstrated how maintenance efficiency can be greatly improved for one of Roche’s core hardware products.",
      "■ My work had a direct impact on strengthening customer trust, and the innovative solution was patented by Roche."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 7.33
  }
},
{
  "_id": {
    "$oid": "649d8dbb10170921a743bf20"
  },
  "index": "CA_resume_1.pdf",
  "category": "chartered accountant",
  "text": "fugeecv simon mukuze cv page 1 5 curriculum vitae simon mukuze fca fcca dip ifrs plot 56526 block 10 gaborone botswana email smukuze cell 267 72608604 career objectives work organisation demand high standard continuous improvement broaden skill base enhance ability add value core competences international financial reporting standards expert financial reporting experience dually listed multinational mining company able manage several task time multitasking good team player interpersonal skill manage provide training subordinate naturally self motivated work minimum supervision highly developed sense professional ethic integrity excellent knowledge application international financial reporting standards knowledge erp accounting system employment profile freelance consultant major client served currently include bothakga burrow mining pty ltd corporate management services pty ltd botswana accountancy college university derby uk programme discovery metals limited period employment january 2011 october 2012 business unit finance position financial superintendent grant thornton botswana member firm grant thornton international period employment december 2006 december 2010 business unit audit assurance position audit manager mailtosmukuze simon mukuze cv page 2 5 matamba company chartered accountants zimbabwe period employment may 2001 september 2006 business unit audit assurance position last held audit manager work experience freelance consultant major client served currently include duties responsibility include financial management accounting consulting ifrs consulting preparation annual half year end financial statement comply international financial reporting standards ifrs related report liaising directly external auditor client preparation monthly management account report client financial superintendent discovery metals limited discovery metals limited dml company listed australian stock exchange botswana stock exchange producer copper silver focused developing major asset boseto copper project northwest botswana dml responsible financial reporting accounting taxation payroll duties responsibility included preparation annual half year end financial statement comply international financial reporting standards ifrs related report liaising directly external auditor preparation monthly management account report preparation quarterly financial report supervising payroll function maintaining integrity payroll transaction ensuring maintaining integrity financial transaction company coordinating corporate accounting team element pertaining provision accurate relevant financial information prepare annual operation capital budget company consistent organization guideline responsible tax compliance preparation submission tax return tax payment vat paye wht corporate tax working capital management development implementation sound system internal control simon mukuze cv page 3 5 audit manager grant thornton botswana grant thornton botswana one largest professional service firm botswana member grant thornton international firm specialises audit taxation accounting business risk advisory service grant thornton involved audit preparation financial statement listed company mining company government parastatals small medium company duties responsibility included client relationship management overall management audit process planning completion review audit working paper preparation financial statement accordance applicable reporting framework review financial statement report compliance applicable financial reporting guideline preparation audit report internal control report management letter report may necessary compliance audit donor funded project organisation also international financial reporting standards ifrs champion expert ifrs contact reference grant thornton botswana office ifrs champion responsible review financial statement public interest entity ifrs compliance resolution ifrs technical query related matter development implementation ifrs training development implementation quality control procedure audit manager matamba company chartered accountants zimbabwe matamba company chartered accountants zimbabwe one largest local professional service firm zimbabwe firm specialises audit taxation accounting business risk advisory service duties responsibility included client relationship management overall management audit process planning completion preparation review financial statement accordance applicable reporting framework preparation audit report internal control report management letter report may necessary compliance audit tax planning compliance consultancy simon mukuze cv page 4 5 professional membership 2007 fellow chartered accountant fca botswana institute chartered accountants bica 2006 chartered accountant ca z institute chartered accountants zimbabwe icaz 2005 fellow chartered certified accountant fcca association chartered certified accountants uk acca 2005 registered public auditor rpa z public accountants auditors board zimbabwe paab 2005 registered public accountant rpacc z public accountants auditors board zimbabwe paab professional qualifications 2011 botswana taxation association chartered certified accountants 2011 diploma international financial reporting standards association chartered certified accountants 2005 public practice examination ii ca institute chartered accountants zimbabwe 2005 advanced certificate auditing accounting professional training republic south africa 2005 public practice examination 1 ca institute chartered accountants zimbabwe 2004 certificate theory accounting cta institute chartered accountants zimbabwe 2003 acca professional scheme association chartered certified accountants acca degree qualifications 2004 honours bachelor accounting science university south africa republic south africa 2003 honours bachelor commerce accounting national university science technology zimbabwe simon mukuze cv page 5 5 qualifications 1998 4 gce alevels mathematics management business economics geography university cambridge local examination syndicate zimbabwe 1996 8 gce olevels including mathematics english sciences geography university cambridge local examination syndicate zimbabwe computer appreciation sage pastel quick book caseware auditcare grant thornton horizon explorer gt voyager pronto xi integrated erp software myob accpac personal details date birth 05 december 1978 country residence botswana citizenship zimbabwean marital status married gender male working botswana past seven year holder sadc drivers licence valid zimbabwean passport hobbies playing soccer reading magazine travelling referees 1 mr dinesh mallan 3 aubrey mbewe audit partner botswana accountancy college grant thornton botswana tel 00 267 72455385 tel 00 267 76230814 e aubreymbacacbw e  2 mr f nhiwatiwa business development manager discovery metals limited botswana tel 00 267 72101483 e freddiscoverymetalscomau  ",
  "parsed_resume": {
    "name": "CURRICULUM VITAE",
    "email": "smukuze@gmail.com",
    "mobile_number": "267 7260860",
    "skills": [
      "System",
      "Accounting",
      "Email",
      "Improvement",
      "Supervising",
      "Financial statements",
      "Auditing",
      "Mathematics",
      "Financial reporting",
      "Erp",
      "Reporting",
      "Compliance",
      "Tax",
      "Continuous improvement",
      "Consulting",
      "Economics",
      "Operations",
      "Queries",
      "Payments",
      "International",
      "Mining",
      "Technical",
      "Audit",
      "Process",
      "Controls",
      "Payroll",
      "Reports",
      "Training",
      "English",
      "Finance",
      "Transactions",
      "Internal controls"
    ],
    "college_name": null,
    "degree": null,
    "designation": [
      "Business Development Manager",
      "Audit Manager",
      "Aubrey Mbewe"
    ],
    "experience": [
      "Freelance Consultant",
      "Major clients being served currently include:",
      "Duties and responsibilities include",
      "IFRS consulting",
      "  Financial and management accounting consulting",
      "",
      "  Preparation  of  annual  and  half  year  end  financial  statements  that  comply  with",
      "International Financial Reporting Standards (IFRS) & related reports and  liaising",
      "directly with external auditors for clients",
      "  Preparation of monthly management accounts and reports for clients",
      "Financial Superintendent - Discovery Metals Limited",
      "Discovery  Metals  Limited  (DML),  a  Company  listed  on  the  Australian  Stock",
      "Exchange and Botswana Stock Exchange is a producer of Copper and Silver focused",
      "on developing its major asset, the Boseto Copper Project in north-west Botswana.",
      "At DML, I was responsible for financial reporting, Accounting, taxation and payroll.",
      "Duties and responsibilities included",
      "  Preparation  of  annual  and  half  year  end  financial  statements  that  comply  with",
      "International Financial Reporting Standards (IFRS) & related reports and liaising",
      "directly with external auditors.",
      "  Preparation of monthly management accounts and reports",
      "  Preparation of quarterly financial reports",
      "  Supervising  the  payroll  function  and  maintaining  the  integrity  of  all  payroll",
      "transactions",
      "  Ensuring  and  maintaining  the  integrity  of  all  financial  transactions  of  the",
      "company",
      "  Coordinating  the  corporate  accounting  team  in  all  elements  pertaining  to  the",
      "provision of accurate and relevant financial information",
      "  Prepare  the  annual  operations  and  capital  budgets  for  the  Company  consistent",
      "with the organizations guidelines",
      "  Responsible  for tax compliance  – preparation and submission of tax returns and",
      "tax payments (VAT, PAYE, WHT, Corporate taxes).",
      "  Working capital management",
      "  Development and implementation of sound system of internal controls",
      "Simon Mukuze CV",
      "Page 2 of 5",
      "Audit Manager - Grant Thornton Botswana",
      "Grant Thornton Botswana is one of the largest professional services firm in Botswana",
      "and  is  a  member  of  Grant  Thornton  International.  The  firm  specialises  in  audit,",
      "taxation, Accounting and business risk advisory services",
      "At Grant Thornton, I was involved in the audit and preparation of financial statements",
      "of  listed  companies,  mining  companies,  government  parastatals  and  other  small  to",
      "medium companies.",
      "Duties and responsibilities included",
      "  Client relationship management",
      "  Overall management of the audit process from planning to completion",
      "  Review of audit working papers",
      "  Preparation  of  financial  statements  in  accordance  with  applicable  reporting",
      "framework.",
      "  Review of financial statements or reports for compliance with applicable financial",
      "reporting guidelines",
      "  Preparation of audit reports, internal control reports, management letters and other",
      "reports as may be necessary."
    ],
    "company_names": [
      "ACCA Professional Scheme",
      "Public Practice Examination 1 (CA)",
      "Discovery Metals Limited",
      "Simon Mukuze CV"
    ],
    "no_of_pages": 5,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8dbc10170921a743bf21"
  },
  "index": "CA_resume_5.pdf",
  "category": "chartered accountant",
  "text": "ethan miller 456 elm st london uk 123 4567891  objective experienced chartered accountant solid background auditing consulting working within company gold standard control infrastructure aiming leverage expertise process improvement accounting policy consultation team collaboration reputable global commodity trading business proven record owning trading flow preparing financial report participating key finance change project skills process improvement control documentation consulting accounting policy ownership product trading flow preparation financial report analysis finance change project participation collaborative team player excellent written verbal communication knowledge accounting principle regulatory standard initiative problemsolving strong interest technology automation work experience senior chartered accountant pqr global trading ltd london uk march 2019 present led process improvement initiative address identified weakness current process provided consultation accounting policy related new corporate trading transaction took ownership certain product trading flow monthend management reporting deadline liaising front middle office resolve issue prepared standard ad hoc financial report analysis senior executive stakeholder board member inform aid decisionmaking participated key finance change project identified process improvement drive efficiency effectiveness team collaborated team annual audit process group including liaising external auditor chartered accountant lmn financial services london uk january 2015 february 2019 audited documented control within company sophisticated process prepared presented regular financial report analysis worked closely team drive process improvement enhance control infrastructure assisted annual audit process liaising external auditor required education chartered certified accountant acca association chartered certified accountants uk 2014 bachelor science accounting finance london school economics london uk 2010 2013 references available upon request devoted meticulous professional take pride improving process contributing control infrastructure aiding sound financial decision making affinity technology automation continually aim enhance efficiency productivity within team excited bring skill experience global commodity trading business value customer service creativity transparency integrity responsibility",
  "parsed_resume": {
    "name": "Ethan Miller",
    "email": "ethanmiller@email.com",
    "mobile_number": "456-7891",
    "skills": [
      "Financial reports",
      "Accounting",
      "Improvement",
      "Auditing",
      "Reporting",
      "Process improvements",
      "Customer service",
      "Regulatory",
      "Automation",
      "Communication",
      "Consulting",
      "Economics",
      "Audit",
      "Process",
      "Process improvement",
      "Controls",
      "Reports",
      "Documentation",
      "Finance",
      "Transactions"
    ],
    "college_name": null,
    "degree": [
      "Bachelor of Science in Accounting and Finance - London School of Economics, London,\nUK (2010 - 2013)"
    ],
    "designation": [
      "Senior Chartered Accountant"
    ],
    "experience": [
      "Senior Chartered Accountant - PQR Global Trading Ltd., London, UK (March 2019 -",
      "Present)",
      "Led process improvement initiatives to address identified weaknesses in current",
      "processes.",
      "Provided consultation on accounting policy related to new corporate and trading",
      "transactions.",
      "Took ownership of certain product trading flows during month-end management",
      "reporting deadlines, liaising with front and middle office to resolve any issues.",
      "Prepared standard and ad hoc financial reports and analyses for senior",
      "executives, stakeholders, and board members to inform and aid decision-making."
    ],
    "company_names": [
      "PQR Global Trading Ltd."
    ],
    "no_of_pages": 2,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8dbd10170921a743bf22"
  },
  "index": "CA_resume_3.pdf",
  "category": "chartered accountant",
  "text": "john doe 123 main st middlesbrough uk 123 4567890  objective qualified experienced chartered accountant history providing accurate trustworthy infor mation financial record proficient financial reporting taxation forensic accounting corporate finan ce accounting system looking utilize skill experience established familyrun firm maximize profitability skills accounting taxation financial forecasting reporting bookkeeping tax planning team management communication collaboration knowledge personal tax sole trade account partnership work experience senior chartered accountant xyz co leeds uk january 2017 present prepared account client record submitted tax return sole trader partnership lim ited company managed bookkeeping vat return developed yearly financial statement including cash flow profit loss balance sheet ensured accuracy business account alerted accountant error prepared management account provided forecast liaised hmrc recording tax compliance investigation mentored managed small team accountant providing guidance feedback managed mentored team two reporting back office manager interacted professionally employee client performed quality work within deadline wit h without supervision accountant abc associates middlesbrough uk january 2012 december 2016 developed maintained accounting system process interacted professionally client colleague providing accurate timely information mentored junior team member fostering collaborative efficient work environment provided advice tax planning client education chartered accountant ca institute chartered accountants england wales icaew uk 201 1 bachelor science accounting university durham durham uk 2007 2010 references available upon request adept professional aim maximize client profitability strategic tax planning effi cient financial reporting believe mentoring team member foster environment growth collaboration look forward bringing skill experience wellestablished familyrun firm like trc ne",
  "parsed_resume": {
    "name": "John Doe",
    "email": "johndoe@email.com",
    "mobile_number": "456-7890",
    "skills": [
      "Accounting",
      "Investigations",
      "Forecasting",
      "Reporting",
      "Compliance",
      "Cash flow",
      "Tax",
      "Forecasts",
      "Partnerships",
      "Communication",
      "Financial reporting"
    ],
    "college_name": null,
    "degree": [
      "johndoe@email.com"
    ],
    "designation": [
      "Senior Chartered Accountant"
    ],
    "experience": [
      "Senior Chartered Accountant - XYZ & Co., Leeds, UK (January 2017 - Present)",
      "Prepared accounts from client records and submitted tax returns for sole traders, partnerships, and Lim",
      "ited companies.",
      "Managed bookkeeping and VAT returns.",
      "Developed yearly financial statements including cash flow, profit and loss, and balance sheets.",
      "Ensured accuracy of business accounts and alerted accountants of any errors.",
      "Prepared management accounts and provided forecasts.",
      "Liaised with HMRC recording tax compliance and investigations.",
      "Mentored and managed a small team of accountants, providing guidance and feedback.",
      "Managed and mentored a team of two, reporting back to the office manager.",
      "Interacted professionally with other employees and clients, performed quality work within deadlines wit",
      "h or without supervision.",
      "Accountant - ABC Associates, Middlesbrough, UK (January 2012 - December 2016)",
      "Developed and maintained accounting systems and processes.",
      "Interacted professionally with clients and colleagues, providing accurate and timely information.",
      "Mentored junior team members, fostering a collaborative and efficient work environment.",
      "Provided advice on tax planning for clients."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 11.33
  }
},
{
  "_id": {
    "$oid": "649d8dbe10170921a743bf23"
  },
  "index": "CA_resume_2.pdf",
  "category": "chartered accountant",
  "text": "microsoft word beautifulresumeforcasample2doc sample ca resume free download word document ca neha kumar career objective desire work organisation help prosper professionally well personal front wish work competitive environment give challenge overcome new frontier explore work organisation knowledge skill utilised optimum personal information address 701 new manoj chs link road opp yogi nagar borivali west mumbai400091 languages known english hindi marathi gujarati phone 09xxxxxxxxxx date birth 26031988 email id  marital status single personal academic qualification qualification instituteboard year percentage scored ca final icai may 2011 5512 cleared us cfa level 1 first attempt  mumbai university college narsee monjee college commerce economics vile parle 20082009 7884 certificate holder ncfmcapital market dealers module derivatives dealers module experience name company job position functiondepartment deloitte haskins sells assistant manager audit enterprise risk service function sudit k parekh co article assistant audit assurance department prashant shah associates article assistant taxation audit scope work auditing assurance performed statutory tax audits public private company insurance company reinsurance insurance brokers liaison office foreign company performed investigation audit mutual fund mandated sebi performed compliance audit registration transfer agent depository participant taxation computation total income preparing filing income tax returns preparation filing service tax vat returns achievements secured 30th rank cacpt india planning organising committee narsee monjee colleges inter collegiate festival umang 2 year represented nmcollege inter college cricket tournament took part several quiz elocution dance drawing competition school level skills usage microsoft office tally 72 tally 9 erp customised accounting package excellent knowledge preparing excel based automated financial model well versed usage internet professional requirement undertook 100 hour information technology training recommended institute chartered accountants india aptech computer education private ltd completed gmcs course general management communication skills conducted icai reference available request",
  "parsed_resume": {
    "name": "CA Resume",
    "email": "nehakumar@abc.com",
    "mobile_number": "008-2009",
    "skills": [
      "Accounting",
      "Economics",
      "Email",
      "English",
      "Erp",
      "Training",
      "Microsoft office",
      "Auditing",
      "Filing",
      "Compliance",
      "Tax",
      "Excel",
      "Cfa",
      "Communication",
      "Audit",
      "Word",
      "Investigation"
    ],
    "college_name": null,
    "degree": null,
    "designation": [
      "Assistant Manager"
    ],
    "experience": [
      "Name of the Company",
      "Deloitte Haskins & Sells",
      "Job Position",
      "Assistant Manager",
      "Sudit k Parekh & Co.",
      "Article Assistant",
      "Prashant Shah & Associates",
      "Article Assistant",
      "Function/Department",
      "Audit & Enterprise Risk",
      "Service Function",
      "Audit & Assurance",
      "department",
      "Taxation & Audit",
      "Scope of Work",
      "Auditing and Assurance",
      "www.cv-resumesamples.blogspot.com",
      "Ø  Performed Statutory & Tax Audits for",
      "Taxation",
      "Public &Private companies,",
      "Insurance companies, Reinsurance",
      "and Insurance Brokers, Liaison office",
      "of a Foreign Company",
      "Ø  Performed Investigation Audit of a",
      "Mutual Fund mandated by SEBI",
      "Ø  Performed compliance Audit of",
      "Registration and transfer agents and",
      "Depository participants",
      "Ø  Computation of Total Income,",
      "preparing and filing of Income Tax",
      "Returns",
      "Ø  Preparation and filing of Service Tax",
      "and VAT Returns",
      "Achievements",
      "Ø  Secured 30th rank in CA-CPT all over India",
      "Ø  Was in the planning and organising committee of Narsee Monjee College’s Inter",
      "collegiate festival “Umang” for 2 years",
      "Ø  Represented N.M.College in the Inter College Cricket Tournament",
      "Ø  Took part and won several quiz, elocution, dance and drawing competition at school",
      "level"
    ],
    "company_names": [
      "Public &Private companies",
      "Prashant Shah & Associates"
    ],
    "no_of_pages": 2,
    "total_experience": 0
  }
},
{
  "_id": {
    "$oid": "649d8dbf10170921a743bf24"
  },
  "index": "CA_resume_4.pdf",
  "category": "chartered accountant",
  "text": "emily johnson 123 beech rd manchester uk 123 4567892  objective accacertified financial accountant comprehensive experience maintaining establishing highquality management account vat corporation tax completion maintaining intercompany reconciliation looking apply expertise dynamic fastpaced environment collinson group focus improving monthend close accounting system skills management monthly account production detailed pl trend analysis analytical review balance sheet reconciliation intercompany position reconciliation collaborative work commercial team audit support completion vat corporation tax 3rd party reporting cashflow forecasting training development assistant financial accountants expertise sapmaconomyaccess dimensions accounting system delivery pressure high level motivation strong organization planning skill effective confident communication work experience financial accountant xyz financial solutions manchester uk june 2018 present responsible production monthly management account ensuring accuracy managed balance sheet reconciliation intercompany position liaised commercial team revenue accrual earned premium profit share journal assisted financial reporting manager audit managed vat corporation tax 3rd party reporting managed delivery cashflow forecast assisted finance transformation project line managed assistant financial accountants assistant financial accountant abc accounting firm manchester uk june 2014 may 2018 assisted production monthly management account aided balance sheet reconciliation assisted vat corporation tax 3rd party reporting helped maintain cashflow forecast supported financial accountants audit process education acca association chartered certified accountants uk 2014 bachelor science accounting finance university manchester manchester uk 2010 2013 references available upon request highly motivated detailoriented deliveryfocused financial accountant excel managing conflicting priority performing well pressure believe developing strong working relationship internally externally aim achieve best outcome business customer im excited opportunity bring skill collinson group globally recognized leader loyalty engagement contribute financial aspect mission",
  "parsed_resume": {
    "name": "Emily Johnson",
    "email": "emilyjohnson@email.com",
    "mobile_number": "4567892",
    "skills": [
      "System",
      "Accounting",
      "Training",
      "Forecasting",
      "Access",
      "Engagement",
      "Reporting",
      "Finance",
      "Analysis",
      "Sap",
      "Tax",
      "Forecasts",
      "Analytical",
      "Audit",
      "Communication",
      "Excel",
      "Reconciliation"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
      "Financial Accountant XYZFinancialSolutions,Manchester,UK(June2018",
      "Present)",
      "Responsible for the production of monthly management accounts, ensuring their",
      "accuracy.",
      "Managed balance sheet reconciliations and intercompany position.",
      "Liaised with Commercial teams for revenue accruals, earned premiums, and profit",
      "share journals.",
      "Assisted the Financial Reporting Manager in all audits.",
      "Managed VAT, Corporation Tax, and 3rd party reporting.",
      "Managed the delivery of the cashflow forecast.",
      "Assisted with Finance Transformation projects.",
      "Line managed the Assistant Financial Accountants.",
      "Assistant Financial Accountant ABCAccountingFirm,Manchester,UK(June2014",
      "May2018)",
      "Assisted with the production of monthly management accounts.",
      "Aided in balance sheet reconciliations.",
      "Assisted in VAT, Corporation Tax, and 3rd party reporting.",
      "Helped maintain cashflow forecasts.",
      "Supported Financial Accountants in audit processes."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 0
  }
}]